--------------------------------------------------------------------------------
      name:  <unnamed>
       log:  c:\Eco387\luis84.log
  log type:  text
 opened on:   8 Nov 2022, 12:30:50

. 
. local year "03 04 05 06 07 08 09 10 11 12 13 14 15 16 17 18 19 20 21"

. 
. local month "jan feb mar apr may jun jul aug sep oct nov dec"

. /*
> foreach y of local year {
> foreach n of local month {
> infix   hrmonth         16-17 ///
>                 year            18-21 ///
>                 state     93 - 94       ///
>                 race        139 - 140           ///
>                 sex         129 - 130                   ///
>                 edu                     137 - 138       ///
>                 smsa        105         ///     
>                 age                     122 - 123       ///
>                 marital         125 - 126 ///
>                 hisp            157 - 158 ///
>                 pemlr           180 - 181 ///
>                 finalwgt        613 - 622 ///
> using c:/Eco387/CPS_data20`y'/`n'`y'pub.dat
> save cpsb`y'`n'.dta, replace
> su
> clear
> }
> }
> */
. use cpsb03jan.dta, clear

. 
. drop if year==2003 & hrmonth==1
(159,376 observations deleted)

. 
. foreach y of local year {
  2. foreach n of local month {
  3. append using cpsb`y'`n'.dta
  4. }
  5. }

. 
. keep if (age >= 18 & age <= 64) & pemlr<=4 
(20,033,599 observations deleted)

. 
. gen female=(sex==2)

. 
. gen less_hi=(edu==38)

. gen hi_sch=(edu==39)

. gen some_col=(edu>=40 & edu <=42)

. gen more_col=(edu >=43)

. 
. gen white=(race==1 & hisp==2)                                   /* Generate th
> e Non-Hispanic whites dummy */

. gen black=(race==2 & hisp==2)                                   /* Generate th
> e Non-Hispanic black dummy */

. gen hispanic=(hisp==1)                                                  /* Gen
> erate the Hispanic dummy */

. gen other=(white==0 & black==0 & hispanic==0)   /* Generate the other race dum
> my */

. 
. gen agesq=age*age

. 
. gen msa=(smsa==1) /* Metropolitan Statistical Area (urban area) dummy */

. 
. gen married=(marital==1)

. 
. gen weight=finalwgt/10000       

. 
. svyset [pweight=weight]         /* Declare survey design for dataset: the samp
> ling weight, pweight, is the variable weight */

      pweight: weight
          VCE: linearized
  Single unit: missing
     Strata 1: <one>
         SU 1: <observations>
        FPC 1: <zero>

. 
. 
. 
. gen federal_min = 0 

. replace federal_min = 5.15 if year == 2003 
(818,218 real changes made)

.  
. gen state_min = 0 

. 
. replace state_min = 7.15 if year == 2003 & state== 2
(12,582 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 5
(8,485 real changes made)

. replace state_min = 6.75 if year == 2003 & state== 6
(55,492 real changes made)

. 
. replace state_min = 5.15 if year == 2003 & state== 8 
(18,625 real changes made)

. replace state_min = 6.90 if year == 2003 & state== 9 
(14,510 real changes made)

. replace state_min = 6.15 if year == 2003 & state== 10 
(10,477 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 13
(11,512 real changes made)

. 
. replace state_min = 6.25 if year == 2003 & state== 15 
(10,338 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 16 
(10,245 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 17 
(28,600 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 18
(15,808 real changes made)

. 
. replace state_min = 5.15 if year == 2003 & state== 19 
(14,792 real changes made)

. replace state_min = 2.65 if year == 2003 & state== 20 
(14,412 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 21
(10,562 real changes made)

. replace state_min = 6.25 if year == 2003 & state== 23
(14,287 real changes made)

. 
. replace state_min = 5.15 if year == 2003 & state== 24 
(13,240 real changes made)

. replace state_min = 6.75 if year == 2003 & state== 25 
(16,538 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 26
(22,899 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 27
(17,266 real changes made)

. 
. replace state_min = 5.15 if year == 2003 & state== 29 
(13,145 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 30
(9,274 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 31
(14,236 real changes made)

. replace state_min = 5.15 if year == 2003 & state==32
(16,055 real changes made)

. 
. replace state_min = 5.15 if year == 2003 & state== 33
(15,587 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 34 
(20,869 real changes made)

. replace state_min = 4.25 if year == 2003 & state== 35 
(8,791 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 36
(38,162 real changes made)

.  
. replace state_min = 5.15 if year == 2003 & state== 37 
(17,195 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 38 
(12,106 real changes made)

. replace state_min = 4.25 if year == 2003 & state== 39 
(25,501 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 40 
(9,730 real changes made)

. 
. replace state_min = 6.90 if year == 2003 & state== 41
(13,368 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 42
(29,111 real changes made)

. replace state_min = 6.15 if year == 2003 & state== 44 
(14,935 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 46
(13,688 real changes made)

. replace state_min = 5.25 if year == 2003 & state== 48 
(35,015 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 49
(11,895 real changes made)

. 
. replace state_min = 6.25 if year == 2003 & state== 50
(13,055 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 51 
(14,087 real changes made)

. replace state_min = 7.01 if year == 2003 & state== 53 
(14,863 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 54 
(9,981 real changes made)

. 
. replace state_min = 5.15 if year == 2003 & state== 55 
(17,790 real changes made)

. replace state_min = 5.15 if year == 2003 & state== 56 
(11,600 real changes made)

.  
. replace federal_min = 5.15 if year == 2004
(804,012 real changes made)

.   
. replace state_min = 7.15 if year == 2004 & state== 2
(12,257 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 5
(8,604 real changes made)

. replace state_min = 6.75 if year == 2004 & state== 6
(56,148 real changes made)

. 
. replace state_min = 5.15 if year == 2004 & state== 8 
(18,230 real changes made)

. replace state_min = 7.10 if year == 2004 & state== 9 
(15,751 real changes made)

. replace state_min = 6.15 if year == 2004 & state== 10 
(10,873 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 13
(12,698 real changes made)

. 
. replace state_min = 6.25 if year == 2004 & state== 15 
(11,153 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 16 
(9,485 real changes made)

. replace state_min = 5.50 if year == 2004 & state== 17 
(27,474 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 18
(14,496 real changes made)

. 
. replace state_min = 5.15 if year == 2004 & state== 19 
(14,909 real changes made)

. replace state_min = 2.65 if year == 2004 & state== 20 
(13,967 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 21
(10,618 real changes made)

. replace state_min = 6.25 if year == 2004 & state== 23
(14,829 real changes made)

. 
. replace state_min = 5.15 if year == 2004 & state== 24 
(14,933 real changes made)

. replace state_min = 6.75 if year == 2004 & state== 25 
(14,905 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 26
(22,018 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 27
(17,857 real changes made)

. 
. replace state_min = 5.15 if year == 2004 & state== 29 
(12,787 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 30
(8,771 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 31
(14,169 real changes made)

. replace state_min = 5.15 if year == 2004 & state==32
(13,858 real changes made)

. 
. replace state_min = 5.15 if year == 2004 & state== 33
(16,326 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 34 
(19,310 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 35 
(8,495 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 36
(35,486 real changes made)

.  
. replace state_min = 5.15 if year == 2004 & state== 37 
(16,883 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 38 
(11,966 real changes made)

. replace state_min = 4.25 if year == 2004 & state== 39 
(24,079 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 40 
(9,073 real changes made)

. 
. replace state_min = 7.05 if year == 2004 & state== 41
(12,010 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 42
(27,901 real changes made)

. replace state_min = 6.75 if year == 2004 & state== 44 
(14,638 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 46
(13,467 real changes made)

. replace state_min = 5.25 if year == 2004 & state== 48 
(35,378 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 49
(11,316 real changes made)

. 
. replace state_min = 6.75 if year == 2004 & state== 50
(13,001 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 51 
(14,513 real changes made)

. replace state_min = 7.16 if year == 2004 & state== 53 
(14,939 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 54 
(9,351 real changes made)

. 
. replace state_min = 5.15 if year == 2004 & state== 55 
(17,028 real changes made)

. replace state_min = 5.15 if year == 2004 & state== 56 
(11,660 real changes made)

.  
. replace federal_min = 5.15 if year == 2005
(800,471 real changes made)

. 
. replace state_min = 7.15 if year == 2005 & state== 2
(11,716 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 5
(8,701 real changes made)

. replace state_min = 6.75 if year == 2005 & state== 6
(61,566 real changes made)

. 
. replace state_min = 5.15 if year == 2005 & state== 8 
(17,713 real changes made)

. replace state_min = 7.10 if year == 2005 & state== 9 
(17,382 real changes made)

. replace state_min = 6.15 if year == 2005 & state== 10 
(12,125 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 13
(15,942 real changes made)

. 
. replace state_min = 6.25 if year == 2005 & state== 15 
(12,524 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 16 
(9,596 real changes made)

. replace state_min = 6.50 if year == 2005 & state== 17 
(25,083 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 18
(13,286 real changes made)

. 
. replace state_min = 5.15 if year == 2005 & state== 19 
(15,519 real changes made)

. replace state_min = 2.65 if year == 2005 & state== 20 
(12,264 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 21
(10,691 real changes made)

. replace state_min = 6.35 if year == 2005 & state== 23
(15,867 real changes made)

. 
. replace state_min = 5.15 if year == 2005 & state== 24 
(17,717 real changes made)

. replace state_min = 6.75 if year == 2005 & state== 25 
(12,937 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 26
(20,436 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 27
(20,145 real changes made)

. 
. replace state_min = 5.15 if year == 2005 & state== 29 
(13,744 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 30
(8,203 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 31
(13,184 real changes made)

. replace state_min = 5.15 if year == 2005 & state==32
(12,147 real changes made)

. 
. replace state_min = 5.15 if year == 2005 & state== 33
(17,626 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 34 
(16,731 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 35 
(7,661 real changes made)

. replace state_min = 6.00 if year == 2005 & state== 36
(33,265 real changes made)

.  
. replace state_min = 5.15 if year == 2005 & state== 37 
(16,010 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 38 
(10,891 real changes made)

. replace state_min = 4.25 if year == 2005 & state== 39 
(23,209 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 40 
(9,088 real changes made)

. 
. replace state_min = 7.25 if year == 2005 & state== 41
(10,784 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 42
(25,080 real changes made)

. replace state_min = 6.75 if year == 2005 & state== 44 
(14,172 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 46
(13,377 real changes made)

. replace state_min = 5.25 if year == 2005 & state== 48 
(38,123 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 49
(11,378 real changes made)

. 
. replace state_min = 7.00 if year == 2005 & state== 50
(12,544 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 51 
(17,256 real changes made)

. replace state_min = 7.35 if year == 2005 & state== 53 
(14,651 real changes made)

. replace state_min = 5.15 if year == 2005 & state== 54 
(8,467 real changes made)

. 
. replace state_min = 5.15 if year == 2005 & state== 55 
(15,911 real changes made)

. replace state_min = 5.15 if year == 2005  & state== 56 
(10,603 real changes made)

.  
. replace federal_min = 5.15 if year == 2006
(795,613 real changes made)

.  
. replace state_min = 7.15 if year == 2006 & state== 2
(11,558 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 5
(7,988 real changes made)

. replace state_min = 6.75 if year == 2006 & state== 6
(63,853 real changes made)

. 
. replace state_min = 5.15 if year == 2006 & state== 8 
(18,019 real changes made)

. replace state_min = 7.40 if year == 2006 & state== 9
(17,767 real changes made)

. replace state_min = 6.15 if year == 2006 & state== 10
(12,613 real changes made)

. replace state_min = 6.40 if year == 2006 & state== 12
(32,585 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 13
(17,168 real changes made)

. 
. replace state_min = 6.75 if year == 2006 & state== 15 
(12,221 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 16 
(9,405 real changes made)

. replace state_min = 6.50 if year == 2006 & state== 17 
(23,993 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 18
(12,188 real changes made)

. 
. replace state_min = 5.15 if year == 2006 & state== 19 
(15,900 real changes made)

. replace state_min = 2.65 if year == 2006 & state== 20 
(11,741 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 21
(10,719 real changes made)

. replace state_min = 6.50 if year == 2006 & state== 23
(15,528 real changes made)

. 
. replace state_min = 5.15 if year == 2006 & state== 24 
(19,153 real changes made)

. replace state_min = 6.75 if year == 2006 & state== 25 
(11,981 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 26
(18,830 real changes made)

. replace state_min = 6.15 if year == 2006 & state== 27
(20,500 real changes made)

. 
. replace state_min = 5.15 if year == 2006 & state== 29 
(13,631 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 30
(7,999 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 31
(12,559 real changes made)

. replace state_min = 5.15 if year == 2006 & state==32
(12,504 real changes made)

. 
. replace state_min = 5.15 if year == 2006 & state== 33
(18,318 real changes made)

. replace state_min = 6.15 if year == 2006 & state== 34 
(16,497 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 35 
(7,300 real changes made)

. replace state_min = 6.75 if year == 2006 & state== 36
(32,469 real changes made)

.  
. replace state_min = 5.15 if year == 2006 & state== 37 
(15,507 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 38 
(11,099 real changes made)

. replace state_min = 4.25 if year == 2006 & state== 39 
(22,548 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 40 
(9,147 real changes made)

. 
. replace state_min = 7.50 if year == 2006 & state== 41
(10,741 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 42
(23,646 real changes made)

. replace state_min = 6.75 if year == 2006 & state== 44 
(13,723 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 46
(12,882 real changes made)

. replace state_min = 5.25 if year == 2006 & state== 48 
(38,861 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 49
(10,838 real changes made)

. 
. replace state_min = 7.25 if year == 2006 & state== 50
(12,535 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 51 
(17,717 real changes made)

. replace state_min = 7.63 if year == 2006 & state== 53 
(14,276 real changes made)

. replace state_min = 5.15 if year == 2006 & state== 54 
(8,254 real changes made)

. 
. replace state_min = 5.70 if year == 2006 & state== 55 
(15,776 real changes made)

. replace state_min = 5.15 if year == 2006  & state== 56 
(10,611 real changes made)

.  
. replace federal_min = 5.85 if year == 2007 
(785,173 real changes made)

.  
. replace state_min = 7.15 if year == 2007 & state== 2
(11,280 real changes made)

. replace state_min = 6.75 if year == 2007 & state== 4
(9,797 real changes made)

. replace state_min = 6.25 if year == 2007 & state== 5
(8,104 real changes made)

. replace state_min = 7.50 if year == 2007 & state== 6
(63,996 real changes made)

. 
. replace state_min = 6.85 if year == 2007 & state== 8 
(18,067 real changes made)

. replace state_min = 7.65 if year == 2007 & state== 9
(17,464 real changes made)

. replace state_min = 6.65 if year == 2007 & state== 10
(12,281 real changes made)

. replace state_min = 6.67 if year == 2007 & state== 12
(31,404 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 13
(17,123 real changes made)

. 
. replace state_min = 7.25 if year == 2007 & state== 15 
(12,152 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 16 
(9,131 real changes made)

. replace state_min = 7.50 if year == 2007 & state== 17 
(24,221 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 18
(11,902 real changes made)

. 
. replace state_min = 5.15 if year == 2007 & state== 19 
(15,978 real changes made)

. replace state_min = 2.65 if year == 2007 & state== 20 
(11,942 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 21
(10,705 real changes made)

. replace state_min = 6.75 if year == 2007 & state== 23
(15,187 real changes made)

. 
. replace state_min = 6.15 if year == 2007 & state== 24 
(18,889 real changes made)

. replace state_min = 7.50 if year == 2007 & state== 25 
(11,848 real changes made)

. replace state_min = 6.95 if year == 2007 & state== 26
(18,141 real changes made)

. replace state_min = 6.15 if year == 2007 & state== 27
(20,399 real changes made)

. 
. replace state_min = 6.50 if year == 2007 & state== 29 
(13,058 real changes made)

. replace state_min = 6.15 if year == 2007 & state== 30
(7,997 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 31
(12,663 real changes made)

. replace state_min = 6.15 if year == 2007 & state==32
(12,431 real changes made)

. 
. replace state_min = 5.15 if year == 2007 & state== 33
(17,826 real changes made)

. replace state_min = 7.15 if year == 2007 & state== 34 
(16,152 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 35 
(7,193 real changes made)

. replace state_min = 7.15 if year == 2007 & state== 36
(31,308 real changes made)

.  
. replace state_min = 6.15 if year == 2007 & state== 37 
(15,188 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 38 
(10,837 real changes made)

. replace state_min = 6.85 if year == 2007 & state== 39 
(22,051 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 40 
(9,086 real changes made)

. 
. replace state_min = 7.80 if year == 2007 & state== 41
(10,772 real changes made)

. replace state_min = 6.25 if year == 2007 & state== 42
(23,214 real changes made)

. replace state_min = 7.40 if year == 2007 & state== 44 
(13,676 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 46
(12,683 real changes made)

. replace state_min = 5.25 if year == 2007 & state== 48 
(37,715 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 49
(10,269 real changes made)

. 
. replace state_min = 7.53 if year == 2007 & state== 50
(12,147 real changes made)

. replace state_min = 5.15 if year == 2007 & state== 51 
(17,487 real changes made)

. replace state_min = 7.93 if year == 2007 & state== 53 
(14,548 real changes made)

. replace state_min = 5.85 if year == 2007 & state== 54 
(8,314 real changes made)

. 
. replace state_min = 6.50 if year == 2007 & state== 55 
(15,757 real changes made)

. replace state_min = 5.15 if year == 2007  & state== 56 
(10,648 real changes made)

. 
. replace federal_min = 5.85 if year == 2008
(782,339 real changes made)

. 
. replace state_min = 7.15 if year == 2008 & state== 2
(11,298 real changes made)

. replace state_min = 6.90 if year == 2008 & state== 4
(9,170 real changes made)

. replace state_min = 6.25 if year == 2008 & state== 5
(8,027 real changes made)

. replace state_min = 8.00 if year == 2008 & state== 6
(64,864 real changes made)

. 
. replace state_min = 7.02 if year == 2008 & state== 8 
(17,739 real changes made)

. replace state_min = 7.65 if year == 2008 & state== 9
(17,858 real changes made)

. replace state_min = 7.15 if year == 2008 & state== 10
(11,820 real changes made)

. replace state_min = 6.79 if year == 2008 & state== 12
(29,905 real changes made)

. replace state_min = 5.15 if year == 2008 & state== 13
(16,519 real changes made)

. 
. replace state_min = 7.25 if year == 2008 & state== 15 
(12,298 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 16 
(8,597 real changes made)

. replace state_min = 7.75 if year == 2008 & state== 17 
(23,938 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 18
(12,126 real changes made)

. 
. replace state_min = 7.25 if year == 2008 & state== 19 
(15,985 real changes made)

. replace state_min = 2.65 if year == 2008 & state== 20 
(11,886 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 21
(10,542 real changes made)

. replace state_min = 7.00 if year == 2008 & state== 23
(14,820 real changes made)

. 
. replace state_min = 6.15 if year == 2008 & state== 24 
(19,122 real changes made)

. replace state_min = 8.00 if year == 2008 & state== 25 
(12,028 real changes made)

. replace state_min = 7.15 if year == 2008 & state== 26
(17,781 real changes made)

. replace state_min = 6.15 if year == 2008 & state== 27
(20,531 real changes made)

. 
. replace state_min = 6.65 if year == 2008 & state== 29 
(12,979 real changes made)

. replace state_min = 6.25 if year == 2008 & state== 30
(7,655 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 31
(12,915 real changes made)

. replace state_min = 6.33 if year == 2008 & state==32
(12,225 real changes made)

. 
. replace state_min = 6.50 if year == 2008 & state== 33
(18,478 real changes made)

. replace state_min = 7.15 if year == 2008 & state== 34 
(16,572 real changes made)

. replace state_min = 6.50 if year == 2008 & state== 35 
(6,779 real changes made)

. replace state_min = 7.15 if year == 2008 & state== 36
(31,779 real changes made)

.  
. replace state_min = 6.15 if year == 2008 & state== 37 
(15,355 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 38 
(10,718 real changes made)

. replace state_min = 7.00 if year == 2008 & state== 39 
(21,856 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 40 
(8,898 real changes made)

. 
. replace state_min = 7.95 if year == 2008 & state== 41
(11,229 real changes made)

. replace state_min = 7.15 if year == 2008 & state== 42
(24,112 real changes made)

. replace state_min = 7.40 if year == 2008 & state== 44 
(13,373 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 46
(12,587 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 48 
(38,034 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 49
(9,760 real changes made)

. 
. replace state_min = 7.68 if year == 2008 & state== 50
(12,310 real changes made)

. replace state_min = 5.85 if year == 2008 & state== 51 
(17,218 real changes made)

. replace state_min = 8.07 if year == 2008 & state== 53 
(14,243 real changes made)

. replace state_min = 6.55 if year == 2008 & state== 54 
(8,020 real changes made)

. 
. replace state_min = 6.50 if year == 2008 & state== 55 
(15,999 real changes made)

. replace state_min = 5.15 if year == 2008  & state== 56 
(10,614 real changes made)

. 
. replace federal_min = 6.55 if year == 2009
(785,385 real changes made)

. 
. replace state_min = 7.15 if year == 2009 & state== 2
(11,127 real changes made)

. replace state_min = 7.25 if year == 2009 & state== 4
(8,764 real changes made)

. replace state_min = 6.25 if year == 2009 & state== 5
(7,841 real changes made)

. replace state_min = 8.00 if year == 2009 & state== 6
(65,425 real changes made)

. 
. replace state_min = 7.28 if year == 2009 & state== 8 
(17,924 real changes made)

. replace state_min = 8.00 if year == 2009 & state== 9
(18,586 real changes made)

. replace state_min = 7.15 if year == 2009 & state== 10
(11,628 real changes made)

. replace state_min = 7.21 if year == 2009 & state== 12
(29,352 real changes made)

. replace state_min = 5.15 if year == 2009 & state== 13
(16,196 real changes made)

. 
. replace state_min = 7.25 if year == 2009 & state== 15 
(12,129 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 16 
(8,467 real changes made)

. replace state_min = 8.00 if year == 2009 & state== 17 
(24,480 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 18
(11,954 real changes made)

. 
. replace state_min = 7.25 if year == 2009 & state== 19 
(15,862 real changes made)

. replace state_min = 2.65 if year == 2009 & state== 20 
(11,794 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 21
(10,768 real changes made)

. replace state_min = 7.25 if year == 2009 & state== 23
(15,107 real changes made)

. 
. replace state_min = 6.55 if year == 2009 & state== 24 
(19,540 real changes made)

. replace state_min = 8.00 if year == 2009 & state== 25 
(12,062 real changes made)

. replace state_min = 7.40 if year == 2009 & state== 26
(18,165 real changes made)

. replace state_min = 6.15 if year == 2009 & state== 27
(20,599 real changes made)

. 
. replace state_min = 7.05 if year == 2009 & state== 29 
(13,361 real changes made)

. replace state_min = 6.90 if year == 2009 & state== 30
(7,188 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 31
(12,997 real changes made)

. replace state_min = 6.85 if year == 2009 & state==32
(12,054 real changes made)

. 
. replace state_min = 7.25 if year == 2009 & state== 33
(18,296 real changes made)

. replace state_min = 7.15 if year == 2009 & state== 34 
(16,863 real changes made)

. replace state_min = 7.50 if year == 2009 & state== 35 
(6,432 real changes made)

. replace state_min = 7.15 if year == 2009 & state== 36
(32,643 real changes made)

.  
. replace state_min = 6.55 if year == 2009 & state== 37 
(15,312 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 38 
(10,436 real changes made)

. replace state_min = 7.30 if year == 2009 & state== 39 
(22,032 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 40 
(9,131 real changes made)

. 
. replace state_min = 8.40 if year == 2009 & state== 41
(11,568 real changes made)

. replace state_min = 7.15 if year == 2009 & state== 42
(23,375 real changes made)

. replace state_min = 7.40 if year == 2009 & state== 44 
(13,439 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 46
(12,648 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 48 
(39,731 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 49
(9,312 real changes made)

. 
. replace state_min = 8.06 if year == 2009 & state== 50
(12,702 real changes made)

. replace state_min = 6.55 if year == 2009 & state== 51 
(17,070 real changes made)

. replace state_min = 8.55 if year == 2009 & state== 53 
(14,307 real changes made)

. replace state_min = 7.25 if year == 2009 & state== 54 
(7,713 real changes made)

. 
. replace state_min = 6.50 if year == 2009 & state== 55 
(16,016 real changes made)

. replace state_min = 5.15 if year == 2009  & state== 56 
(11,021 real changes made)

. 
. replace federal_min = 7.25 if year == 2010
(781,260 real changes made)

. 
. replace state_min = 7.75 if year == 2010 & state== 2
(10,817 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 4
(8,962 real changes made)

. replace state_min = 6.25 if year == 2010 & state== 5
(7,532 real changes made)

. replace state_min = 8.00 if year == 2010 & state== 6
(65,990 real changes made)

. 
. replace state_min = 7.24 if year == 2010 & state== 8 
(17,952 real changes made)

. replace state_min = 8.25 if year == 2010 & state== 9
(18,813 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 10
(11,684 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 12
(29,172 real changes made)

. replace state_min = 5.15 if year == 2010 & state== 13
(16,514 real changes made)

. 
. replace state_min = 7.25 if year == 2010 & state== 15 
(12,191 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 16 
(8,229 real changes made)

. replace state_min = 8.25 if year == 2010 & state== 17 
(24,327 real changes made)

. replace state_min =  7.25 if year == 2010 & state== 18
(11,617 real changes made)

. 
. replace state_min = 7.25 if year == 2010 & state== 19 
(15,709 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 20 
(11,495 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 21
(10,767 real changes made)

. replace state_min = 7.50 if year == 2010 & state== 23
(15,105 real changes made)

. 
. replace state_min = 7.25 if year == 2010 & state== 24 
(19,356 real changes made)

. replace state_min = 8.00 if year == 2010 & state== 25 
(12,071 real changes made)

. replace state_min = 7.40 if year == 2010 & state== 26
(17,775 real changes made)

. replace state_min = 6.15 if year == 2010 & state== 27
(20,217 real changes made)

. 
. replace state_min = 7.25 if year == 2010 & state== 29 
(13,553 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 30
(7,046 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 31
(12,689 real changes made)

. replace state_min = 7.55 if year == 2010 & state==32
(11,890 real changes made)

. 
. replace state_min = 7.25 if year == 2010 & state== 33
(17,762 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 34 
(16,373 real changes made)

. replace state_min = 7.50 if year == 2010 & state== 35 
(6,094 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 36
(32,310 real changes made)

.  
. replace state_min = 7.25 if year == 2010 & state== 37 
(15,069 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 38 
(10,870 real changes made)

. replace state_min = 7.30 if year == 2010 & state== 39 
(21,702 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 40 
(9,135 real changes made)

. 
. replace state_min = 8.40 if year == 2010 & state== 41
(11,357 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 42
(22,738 real changes made)

. replace state_min = 7.40 if year == 2010 & state== 44 
(13,789 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 46
(12,964 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 48 
(40,232 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 49
(9,243 real changes made)

. 
. replace state_min = 8.06 if year == 2010 & state== 50
(12,559 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 51 
(17,201 real changes made)

. replace state_min = 8.55 if year == 2010 & state== 53 
(13,980 real changes made)

. replace state_min = 7.25 if year == 2010 & state== 54 
(7,165 real changes made)

. 
. replace state_min = 7.25 if year == 2010 & state== 55 
(16,131 real changes made)

. replace state_min = 5.15 if year == 2010  & state== 56 
(10,964 real changes made)

. 
. replace federal_min = 7.25 if year == 2011
(763,863 real changes made)

. 
. replace state_min = 7.75 if year == 2011 & state== 2
(10,200 real changes made)

. replace state_min = 7.35 if year == 2011 & state== 4
(8,911 real changes made)

. replace state_min = 6.25 if year == 2011 & state== 5
(7,459 real changes made)

. replace state_min = 8.00 if year == 2011 & state== 6
(64,596 real changes made)

. 
. replace state_min = 7.36 if year == 2011 & state== 8 
(17,963 real changes made)

. replace state_min = 8.25 if year == 2011 & state== 9
(18,182 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 10
(11,934 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 12
(28,156 real changes made)

. replace state_min = 5.15 if year == 2011 & state== 13
(15,969 real changes made)

. 
. replace state_min = 7.25 if year == 2011 & state== 15 
(11,946 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 16 
(8,432 real changes made)

. replace state_min = 8.25 if year == 2011 & state== 17 
(23,186 real changes made)

. replace state_min =  7.25 if year == 2011 & state== 18
(11,224 real changes made)

. 
. replace state_min = 7.25 if year == 2011 & state== 19 
(15,452 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 20 
(11,407 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 21
(10,556 real changes made)

. replace state_min = 7.50 if year == 2011 & state== 23
(13,854 real changes made)

. 
. replace state_min = 7.25 if year == 2011 & state== 24 
(19,527 real changes made)

. replace state_min = 8.00 if year == 2011 & state== 25 
(12,019 real changes made)

. replace state_min = 7.40 if year == 2011 & state== 26
(16,764 real changes made)

. replace state_min = 6.15 if year == 2011 & state== 27
(20,210 real changes made)

. 
. replace state_min = 7.25 if year == 2011 & state== 29 
(12,780 real changes made)

. replace state_min = 7.35 if year == 2011 & state== 30
(6,890 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 31
(12,749 real changes made)

. replace state_min = 8.25 if year == 2011 & state==32
(11,707 real changes made)

. 
. replace state_min = 7.25 if year == 2011 & state== 33
(17,543 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 34 
(15,817 real changes made)

. replace state_min = 7.50 if year == 2011 & state== 35 
(5,748 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 36
(31,714 real changes made)

.  
. replace state_min = 7.25 if year == 2011 & state== 37 
(14,535 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 38 
(10,611 real changes made)

. replace state_min = 7.40 if year == 2011 & state== 39 
(20,445 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 40 
(8,487 real changes made)

. 
. replace state_min = 8.50 if year == 2011 & state== 41
(11,271 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 42
(22,381 real changes made)

. replace state_min = 7.40 if year == 2011 & state== 44 
(13,136 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 46
(12,780 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 48 
(40,132 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 49
(9,104 real changes made)

. 
. replace state_min = 8.15 if year == 2011 & state== 50
(12,180 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 51 
(17,176 real changes made)

. replace state_min = 8.67 if year == 2011 & state== 53 
(13,744 real changes made)

. replace state_min = 7.25 if year == 2011 & state== 54 
(7,063 real changes made)

. 
. replace state_min = 7.25 if year == 2011 & state== 55 
(15,990 real changes made)

. replace state_min = 5.15 if year == 2011  & state== 56 
(10,757 real changes made)

. 
. replace federal_min = 7.25 if year == 2012
(753,883 real changes made)

. 
. replace state_min = 7.75 if year == 2012 & state== 2
(9,695 real changes made)

. replace state_min = 7.65 if year == 2012 & state== 4
(8,765 real changes made)

. replace state_min = 6.25 if year == 2012 & state== 5
(7,412 real changes made)

. replace state_min = 8.00 if year == 2012 & state== 6
(64,461 real changes made)

. 
. replace state_min = 7.64 if year == 2012 & state== 8 
(17,792 real changes made)

. replace state_min = 8.25 if year == 2012 & state== 9
(17,225 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 10
(11,361 real changes made)

. replace state_min = 7.67 if year == 2012 & state== 12
(28,400 real changes made)

. replace state_min = 5.15 if year == 2012 & state== 13
(15,533 real changes made)

. 
. replace state_min = 7.25 if year == 2012 & state== 15 
(11,583 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 16 
(8,241 real changes made)

. replace state_min = 8.25 if year == 2012 & state== 17 
(23,750 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 18
(10,996 real changes made)

. 
. replace state_min = 7.25 if year == 2012 & state== 19 
(15,306 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 20 
(11,038 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 21
(10,694 real changes made)

. replace state_min = 7.50 if year == 2012 & state== 23
(13,689 real changes made)

. 
. replace state_min = 7.25 if year == 2012 & state== 24 
(18,912 real changes made)

. replace state_min = 8.00 if year == 2012 & state== 25 
(11,755 real changes made)

. replace state_min = 7.40 if year == 2012 & state== 26
(16,930 real changes made)

. replace state_min = 6.15 if year == 2012 & state== 27
(20,140 real changes made)

. 
. replace state_min = 7.25 if year == 2012 & state== 29 
(12,215 real changes made)

. replace state_min = 7.65 if year == 2012 & state== 30
(6,770 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 31
(12,796 real changes made)

. replace state_min = 8.25 if year == 2012 & state==32
(11,411 real changes made)

. 
. replace state_min = 7.25 if year == 2012 & state== 33
(17,054 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 34 
(15,382 real changes made)

. replace state_min = 7.50 if year == 2012 & state== 35 
(5,720 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 36
(31,368 real changes made)

.  
. replace state_min = 7.25 if year == 2012 & state== 37 
(14,719 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 38 
(10,784 real changes made)

. replace state_min = 7.70 if year == 2012 & state== 39 
(19,611 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 40 
(8,201 real changes made)

. 
. replace state_min = 8.80 if year == 2012 & state== 41
(10,756 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 42
(22,888 real changes made)

. replace state_min = 7.40 if year == 2012 & state== 44 
(12,842 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 46
(12,241 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 48 
(40,230 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 49
(9,334 real changes made)

. 
. replace state_min = 8.46 if year == 2012 & state== 50
(11,976 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 51 
(16,756 real changes made)

. replace state_min = 9.04 if year == 2012 & state== 53 
(13,514 real changes made)

. replace state_min = 7.25 if year == 2012 & state== 54 
(7,027 real changes made)

. 
. replace state_min = 7.25 if year == 2012 & state== 55 
(15,565 real changes made)

. replace state_min = 5.15 if year == 2012  & state== 56 
(10,233 real changes made)

. 
. replace federal_min = 7.25 if year == 2013
(741,907 real changes made)

. 
. replace state_min = 7.75 if year == 2013 & state== 2
(9,354 real changes made)

. replace state_min = 7.80 if year == 2013 & state== 4
(8,381 real changes made)

. replace state_min = 6.25 if year == 2013 & state== 5
(7,478 real changes made)

. replace state_min = 8.00 if year == 2013 & state== 6
(64,652 real changes made)

. 
. replace state_min = 7.78 if year == 2013 & state== 8 
(17,891 real changes made)

. replace state_min = 8.25 if year == 2013 & state== 9
(16,748 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 10
(11,042 real changes made)

. replace state_min = 7.79 if year == 2013 & state== 12
(28,377 real changes made)

. replace state_min = 5.15 if year == 2013 & state== 13
(15,640 real changes made)

. 
. replace state_min = 7.25 if year == 2013 & state== 15 
(11,557 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 16 
(7,951 real changes made)

. replace state_min = 8.25 if year == 2013 & state== 17 
(23,091 real changes made)

. replace state_min =  7.25 if year == 2013 & state== 18
(10,981 real changes made)

. 
. replace state_min = 7.25 if year == 2013 & state== 19 
(15,281 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 20 
(11,245 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 21
(10,419 real changes made)

. replace state_min = 7.50 if year == 2013 & state== 23
(13,110 real changes made)

. 
. replace state_min = 7.25 if year == 2013 & state== 24 
(18,825 real changes made)

. replace state_min = 8.00 if year == 2013 & state== 25 
(11,135 real changes made)

. replace state_min = 7.40 if year == 2013 & state== 26
(16,546 real changes made)

. replace state_min = 6.15 if year == 2013 & state== 27
(19,553 real changes made)

. 
. replace state_min = 7.25 if year == 2013 & state== 29 
(12,113 real changes made)

. replace state_min = 7.80 if year == 2013 & state== 30
(6,909 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 31
(12,117 real changes made)

. replace state_min = 8.25 if year == 2013 & state==32
(10,753 real changes made)

. 
. replace state_min = 7.25 if year == 2013 & state== 33
(16,603 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 34 
(14,582 real changes made)

. replace state_min = 7.50 if year == 2013 & state== 35 
(5,492 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 36
(30,045 real changes made)

.  
. replace state_min = 7.25 if year == 2013 & state== 37 
(14,473 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 38 
(10,898 real changes made)

. replace state_min = 7.85 if year == 2013 & state== 39 
(19,790 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 40 
(8,168 real changes made)

. 
. replace state_min = 8.95 if year == 2013 & state== 41
(10,339 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 42
(22,488 real changes made)

. replace state_min = 7.75 if year == 2013 & state== 44 
(12,188 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 46
(12,014 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 48 
(39,972 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 49
(9,617 real changes made)

. 
. replace state_min = 8.60 if year == 2013 & state== 50
(11,318 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 51 
(16,895 real changes made)

. replace state_min = 9.19 if year == 2013 & state== 53 
(13,401 real changes made)

. replace state_min = 7.25 if year == 2013 & state== 54 
(6,801 real changes made)

. 
. replace state_min = 7.25 if year == 2013 & state== 55 
(15,749 real changes made)

. replace state_min = 5.15 if year == 2013  & state== 56 
(9,572 real changes made)

. 
. replace federal_min = 7.25 if year == 2014
(738,066 real changes made)

. 
. replace state_min = 7.75 if year == 2014 & state== 2
(9,325 real changes made)

. replace state_min = 7.90 if year == 2014 & state== 4
(9,474 real changes made)

. replace state_min = 6.25 if year == 2014 & state== 5
(8,854 real changes made)

. replace state_min = 9.00 if year == 2014 & state== 6
(64,211 real changes made)

. 
. replace state_min = 8.00 if year == 2014 & state== 8 
(15,339 real changes made)

. replace state_min = 8.70 if year == 2014 & state== 9
(14,090 real changes made)

. replace state_min = 7.75 if year == 2014 & state== 10
(10,440 real changes made)

. replace state_min = 7.93 if year == 2014 & state== 12
(28,478 real changes made)

. replace state_min = 5.15 if year == 2014 & state== 13
(15,364 real changes made)

. 
. replace state_min = 7.25 if year == 2014 & state== 15 
(11,471 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 16 
(8,940 real changes made)

. replace state_min = 8.25 if year == 2014 & state== 17 
(22,895 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 18
(11,254 real changes made)

. 
. replace state_min = 7.25 if year == 2014 & state== 19 
(13,375 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 20 
(10,925 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 21
(9,897 real changes made)

. replace state_min = 7.50 if year == 2014 & state== 23
(10,672 real changes made)

. 
. replace state_min = 7.25 if year == 2014 & state== 24 
(15,783 real changes made)

. replace state_min = 8.00 if year == 2014 & state== 25 
(12,335 real changes made)

. replace state_min = 8.15 if year == 2014 & state== 26
(16,108 real changes made)

. replace state_min = 8.00 if year == 2014 & state== 27
(17,037 real changes made)

. 
. replace state_min = 7.50 if year == 2014 & state== 29 
(11,429 real changes made)

. replace state_min = 7.90 if year == 2014 & state== 30
(9,715 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 31
(11,114 real changes made)

. replace state_min = 8.25 if year == 2014 & state==32
(10,167 real changes made)

. 
. replace state_min = 7.25 if year == 2014 & state== 33
(14,731 real changes made)

. replace state_min = 8.25 if year == 2014 & state== 34 
(15,040 real changes made)

. replace state_min = 7.50 if year == 2014 & state== 35 
(7,333 real changes made)

. replace state_min = 8.00 if year == 2014 & state== 36
(29,716 real changes made)

.  
. replace state_min = 7.25 if year == 2014 & state== 37 
(14,888 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 38 
(11,633 real changes made)

. replace state_min = 7.95 if year == 2014 & state== 39 
(19,497 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 40 
(8,941 real changes made)

. 
. replace state_min = 9.10 if year == 2014 & state== 41
(10,382 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 42
(21,704 real changes made)

. replace state_min = 8.00 if year == 2014 & state== 44 
(10,613 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 46
(11,301 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 48 
(40,231 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 49
(9,747 real changes made)

. 
. replace state_min = 8.73 if year == 2014 & state== 50
(10,727 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 51 
(16,257 real changes made)

. replace state_min = 9.32 if year == 2014 & state== 53 
(13,228 real changes made)

. replace state_min = 7.25 if year == 2014 & state== 54 
(9,352 real changes made)

. 
. replace state_min = 7.25 if year == 2014 & state== 55 
(14,283 real changes made)

. replace state_min = 5.15 if year == 2014  & state== 56 
(10,598 real changes made)

. 
. replace federal_min = 7.25 if year == 2015
(718,949 real changes made)

. 
. replace state_min = 8.75 if year == 2015 & state== 2
(9,142 real changes made)

. replace state_min = 8.05 if year == 2015 & state== 4
(10,943 real changes made)

. replace state_min = 7.50 if year == 2015 & state== 5
(11,265 real changes made)

. replace state_min = 9.00 if year == 2015 & state== 6
(62,274 real changes made)

. 
. replace state_min = 8.23 if year == 2015 & state== 8 
(10,678 real changes made)

. replace state_min = 9.15 if year == 2015 & state== 9
(9,275 real changes made)

. replace state_min = 8.25 if year == 2015 & state== 10
(8,460 real changes made)

. replace state_min = 8.05 if year == 2015 & state== 12
(28,998 real changes made)

. replace state_min = 5.15 if year == 2015 & state== 13
(15,396 real changes made)

. 
. replace state_min = 7.75 if year == 2015 & state== 15 
(11,179 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 16 
(10,574 real changes made)

. replace state_min = 8.25 if year == 2015 & state== 17 
(21,605 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 18
(11,629 real changes made)

. 
. replace state_min = 7.25 if year == 2015 & state== 19 
(9,588 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 20 
(9,381 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 21
(8,488 real changes made)

. replace state_min = 7.50 if year == 2015 & state== 23
(6,967 real changes made)

. 
. replace state_min = 8.25 if year == 2015 & state== 24 
(11,031 real changes made)

. replace state_min = 9.00 if year == 2015 & state== 25 
(14,008 real changes made)

. replace state_min = 8.15 if year == 2015 & state== 26
(15,387 real changes made)

. replace state_min = 9.00 if year == 2015 & state== 27
(11,713 real changes made)

. 
. replace state_min = 7.65 if year == 2015 & state== 29 
(10,670 real changes made)

. replace state_min = 8.05 if year == 2015 & state== 30
(13,637 real changes made)

. replace state_min = 8.00 if year == 2015 & state== 31
(9,812 real changes made)

. replace state_min = 8.25 if year == 2015 & state==32
(9,181 real changes made)

. 
. replace state_min = 7.25 if year == 2015 & state== 33
(11,210 real changes made)

. replace state_min = 8.38 if year == 2015 & state== 34 
(15,280 real changes made)

. replace state_min = 7.50 if year == 2015 & state== 35 
(11,206 real changes made)

. replace state_min = 8.75 if year == 2015 & state== 36
(28,723 real changes made)

.  
. replace state_min = 7.25 if year == 2015 & state== 37 
(15,645 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 38 
(12,015 real changes made)

. replace state_min = 8.10 if year == 2015 & state== 39 
(18,434 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 40 
(10,205 real changes made)

. 
. replace state_min = 9.25 if year == 2015 & state== 41
(10,605 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 42
(20,620 real changes made)

. replace state_min = 9.00 if year == 2015 & state== 44 
(7,960 real changes made)

. replace state_min = 8.50 if year == 2015 & state== 46
(8,565 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 48 
(38,992 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 49
(10,867 real changes made)

. 
. replace state_min = 9.15 if year == 2015 & state== 50
(10,130 real changes made)

. replace state_min = 7.25 if year == 2015 & state== 51 
(14,320 real changes made)

. replace state_min = 9.47 if year == 2015 & state== 53 
(12,785 real changes made)

. replace state_min = 8.00 if year == 2015 & state== 54 
(12,902 real changes made)

. 
. replace state_min = 7.25 if year == 2015 & state== 55 
(11,602 real changes made)

. replace state_min = 5.15 if year == 2015  & state== 56 
(10,770 real changes made)

. 
. replace federal_min = 7.25 if year == 2016
(714,471 real changes made)

. 
. replace state_min = 9.75 if year == 2016 & state== 2
(9,148 real changes made)

. replace state_min = 8.05 if year == 2016 & state== 4
(11,331 real changes made)

. replace state_min = 8.00 if year == 2016 & state== 5
(11,804 real changes made)

. replace state_min = 10.00 if year == 2016 & state== 6
(61,690 real changes made)

. 
. replace state_min = 8.31 if year == 2016 & state== 8 
(9,283 real changes made)

. replace state_min = 9.60 if year == 2016 & state== 9
(7,556 real changes made)

. replace state_min = 8.25 if year == 2016 & state== 10
(8,001 real changes made)

. replace state_min = 8.05 if year == 2016 & state== 12
(29,417 real changes made)

. replace state_min = 5.15 if year == 2016 & state== 13
(15,456 real changes made)

. 
. replace state_min = 8.50 if year == 2016 & state== 15 
(10,819 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 16 
(11,466 real changes made)

. replace state_min = 8.25 if year == 2016 & state== 17 
(21,635 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 18
(12,193 real changes made)

. 
. replace state_min = 7.25 if year == 2016 & state== 19 
(8,752 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 20 
(9,215 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 21
(8,376 real changes made)

. replace state_min = 7.50 if year == 2016 & state== 23
(6,178 real changes made)

. 
. replace state_min = 8.75 if year == 2016 & state== 24 
(9,616 real changes made)

. replace state_min = 10.00 if year == 2016 & state== 25 
(15,277 real changes made)

. replace state_min = 8.50 if year == 2016 & state== 26
(15,729 real changes made)

. replace state_min = 9.50 if year == 2016 & state== 27
(9,952 real changes made)

. 
. replace state_min = 7.65 if year == 2016 & state== 29 
(10,180 real changes made)

. replace state_min = 8.05 if year == 2016 & state== 30
(14,414 real changes made)

. replace state_min = 9.00 if year == 2016 & state== 31
(9,742 real changes made)

. replace state_min = 8.25 if year == 2016 & state==32
(8,804 real changes made)

. 
. replace state_min = 7.25 if year == 2016 & state== 33
(10,184 real changes made)

. replace state_min = 8.38 if year == 2016 & state== 34 
(14,688 real changes made)

. replace state_min = 7.50 if year == 2016 & state== 35 
(12,290 real changes made)

. replace state_min = 9.00 if year == 2016 & state== 36
(28,095 real changes made)

.  
. replace state_min = 7.25 if year == 2016 & state== 37 
(15,733 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 38 
(12,139 real changes made)

. replace state_min = 8.10 if year == 2016 & state== 39 
(18,670 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 40 
(10,073 real changes made)

. 
. replace state_min = 9.75 if year == 2016 & state== 41
(10,873 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 42
(20,517 real changes made)

. replace state_min = 9.60 if year == 2016 & state== 44 
(6,706 real changes made)

. replace state_min = 8.55 if year == 2016 & state== 46
(8,403 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 48 
(40,164 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 49
(11,331 real changes made)

. 
. replace state_min = 9.60 if year == 2016 & state== 50
(9,930 real changes made)

. replace state_min = 7.25 if year == 2016 & state== 51 
(13,182 real changes made)

. replace state_min = 9.47 if year == 2016 & state== 53 
(12,662 real changes made)

. replace state_min = 8.75 if year == 2016 & state== 54 
(13,067 real changes made)

. 
. replace state_min = 7.25 if year == 2016 & state== 55 
(10,757 real changes made)

. replace state_min = 5.15 if year == 2016  & state== 56 
(10,964 real changes made)

. 
. replace federal_min = 7.25 if year == 2017
(700,029 real changes made)

. 
. replace state_min = 9.80 if year == 2017 & state== 2
(8,696 real changes made)

. replace state_min = 10.00 if year == 2017 & state== 4
(10,251 real changes made)

. replace state_min = 8.50 if year == 2017 & state== 5
(12,013 real changes made)

. replace state_min = 10.00 if year == 2017 & state== 6
(60,460 real changes made)

. 
. replace state_min = 9.30 if year == 2017 & state== 8 
(9,297 real changes made)

. replace state_min = 10.10 if year == 2017 & state== 9
(7,434 real changes made)

. replace state_min = 8.25 if year == 2017 & state== 10
(7,496 real changes made)

. replace state_min = 8.10 if year == 2017 & state== 12
(29,289 real changes made)

. replace state_min = 5.15 if year == 2017 & state== 13
(15,797 real changes made)

. 
. replace state_min = 9.25 if year == 2017 & state== 15 
(10,610 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 16 
(11,370 real changes made)

. replace state_min = 8.25 if year == 2017 & state== 17 
(20,558 real changes made)

. replace state_min =  7.25 if year == 2017 & state== 18
(11,682 real changes made)

. 
. replace state_min = 7.25 if year == 2017 & state== 19 
(8,370 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 20 
(9,052 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 21
(8,490 real changes made)

. replace state_min = 9.00 if year == 2017 & state== 23
(6,350 real changes made)

. 
. replace state_min = 8.75 if year == 2017 & state== 24 
(9,483 real changes made)

. replace state_min = 11.00 if year == 2017 & state== 25 
(15,611 real changes made)

. replace state_min = 8.90 if year == 2017 & state== 26
(15,822 real changes made)

. replace state_min = 9.50 if year == 2017 & state== 27
(10,090 real changes made)

. 
. replace state_min = 7.70 if year == 2017 & state== 29 
(9,995 real changes made)

. replace state_min = 8.15 if year == 2017 & state== 30
(13,479 real changes made)

. replace state_min = 9.00 if year == 2017 & state== 31
(9,243 real changes made)

. replace state_min = 8.25 if year == 2017 & state==32
(8,558 real changes made)

. 
. replace state_min = 7.25 if year == 2017 & state== 33
(10,070 real changes made)

. replace state_min = 8.44 if year == 2017 & state== 34 
(13,799 real changes made)

. replace state_min = 7.50 if year == 2017 & state== 35 
(11,508 real changes made)

. replace state_min = 9.70 if year == 2017 & state== 36
(27,830 real changes made)

.  
. replace state_min = 7.25 if year == 2017 & state== 37 
(15,321 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 38 
(11,467 real changes made)

. replace state_min = 8.15 if year == 2017 & state== 39 
(18,196 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 40 
(9,828 real changes made)

. 
. replace state_min = 9.75 if year == 2017 & state== 41
(10,651 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 42
(19,366 real changes made)

. replace state_min = 9.60 if year == 2017 & state== 44 
(6,522 real changes made)

. replace state_min = 8.65 if year == 2017 & state== 46
(8,406 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 48 
(39,846 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 49
(11,221 real changes made)

. 
. replace state_min = 10.00 if year == 2017 & state== 50
(9,347 real changes made)

. replace state_min = 7.25 if year == 2017 & state== 51 
(13,435 real changes made)

. replace state_min = 11.00 if year == 2017 & state== 53 
(13,169 real changes made)

. replace state_min = 8.75 if year == 2017 & state== 54 
(13,261 real changes made)

. 
. replace state_min = 7.25 if year == 2017 & state== 55 
(10,424 real changes made)

. replace state_min = 5.15 if year == 2017  & state== 56 
(10,609 real changes made)

. 
. replace federal_min = 7.25 if year == 2018
(675,825 real changes made)

. 
. replace state_min = 9.84 if year == 2018 & state== 2
(8,248 real changes made)

. replace state_min = 10.50 if year == 2018 & state== 4
(10,476 real changes made)

. replace state_min = 8.50 if year == 2018 & state== 5
(11,462 real changes made)

. replace state_min = 11.00 if year == 2018 & state== 6
(58,821 real changes made)

. 
. replace state_min = 10.20 if year == 2018 & state== 8 
(9,365 real changes made)

. replace state_min = 10.10 if year == 2018 & state== 9
(7,055 real changes made)

. replace state_min = 8.25 if year == 2018 & state== 10
(7,600 real changes made)

. replace state_min = 8.25 if year == 2018 & state== 12
(28,149 real changes made)

. replace state_min = 5.15 if year == 2018 & state== 13
(15,561 real changes made)

. 
. replace state_min = 10.10 if year == 2018 & state== 15 
(9,805 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 16 
(11,096 real changes made)

. replace state_min = 8.25 if year == 2018 & state== 17 
(19,524 real changes made)

. replace state_min =  7.25 if year == 2018 & state== 18
(11,628 real changes made)

. 
. replace state_min = 7.25 if year == 2018 & state== 19 
(8,286 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 20 
(8,868 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 21
(7,996 real changes made)

. replace state_min = 10.00 if year == 2018 & state== 23
(5,794 real changes made)

. 
. replace state_min = 10.10 if year == 2018 & state== 24 
(9,394 real changes made)

. replace state_min = 11.00 if year == 2018 & state== 25 
(15,321 real changes made)

. replace state_min = 9.25 if year == 2018 & state== 26
(15,338 real changes made)

. replace state_min = 9.86 if year == 2018 & state== 27
(9,756 real changes made)

. 
. replace state_min = 7.85 if year == 2018 & state== 29 
(9,513 real changes made)

. replace state_min = 8.30 if year == 2018 & state== 30
(12,161 real changes made)

. replace state_min = 9.00 if year == 2018 & state== 31
(9,086 real changes made)

. replace state_min = 8.25 if year == 2018 & state==32
(8,699 real changes made)

. 
. replace state_min = 7.25 if year == 2018 & state== 33
(9,956 real changes made)

. replace state_min = 8.60 if year == 2018 & state== 34 
(13,248 real changes made)

. replace state_min = 7.50 if year == 2018 & state== 35 
(10,635 real changes made)

. replace state_min = 10.40 if year == 2018 & state== 36
(26,571 real changes made)

.  
. replace state_min = 7.25 if year == 2018 & state== 37 
(15,002 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 38 
(10,633 real changes made)

. replace state_min = 8.30 if year == 2018 & state== 39 
(16,964 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 40 
(9,530 real changes made)

. 
. replace state_min = 10.75 if year == 2018 & state== 41
(9,944 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 42
(18,364 real changes made)

. replace state_min = 10.10 if year == 2018 & state== 44 
(6,632 real changes made)

. replace state_min = 8.85 if year == 2018 & state== 46
(8,346 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 48 
(39,195 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 49
(11,043 real changes made)

. 
. replace state_min = 10.50 if year == 2018 & state== 50
(9,318 real changes made)

. replace state_min = 7.25 if year == 2018 & state== 51 
(13,179 real changes made)

. replace state_min = 11.50 if year == 2018 & state== 53 
(12,897 real changes made)

. replace state_min = 8.75 if year == 2018 & state== 54 
(12,768 real changes made)

. 
. replace state_min = 7.25 if year == 2018 & state== 55 
(9,770 real changes made)

. replace state_min = 5.15 if year == 2018  & state== 56 
(9,835 real changes made)

. 
. replace federal_min = 7.25 if year == 2019
(650,511 real changes made)

. 
. replace state_min = 10.19 if year == 2019 & state== 2
(7,968 real changes made)

. replace state_min = 12.00 if year == 2019 & state== 4
(10,538 real changes made)

. replace state_min = 9.25 if year == 2019 & state== 5
(11,240 real changes made)

. replace state_min = 12.00 if year == 2019 & state== 6
(57,066 real changes made)

. 
. replace state_min = 12.00 if year == 2019 & state== 8 
(8,826 real changes made)

. replace state_min = 11.00 if year == 2019 & state== 9
(6,832 real changes made)

. replace state_min = 9.25 if year == 2019 & state== 10
(6,806 real changes made)

. replace state_min = 8.56 if year == 2019 & state== 12
(27,658 real changes made)

. replace state_min = 5.15 if year == 2019 & state== 13
(14,564 real changes made)

. 
. replace state_min = 10.10 if year == 2019 & state== 15 
(9,037 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 16 
(11,029 real changes made)

. replace state_min = 9.25 if year == 2019 & state== 17 
(18,021 real changes made)

. replace state_min =  7.25 if year == 2019 & state== 18
(10,856 real changes made)

. 
. replace state_min = 7.25 if year == 2019 & state== 19 
(8,545 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 20 
(8,532 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 21
(7,213 real changes made)

. replace state_min = 12.00 if year == 2019 & state== 23
(5,281 real changes made)

. 
. replace state_min = 11.00 if year == 2019 & state== 24 
(8,562 real changes made)

. replace state_min = 12.75 if year == 2019 & state== 25 
(14,455 real changes made)

. replace state_min = 9.65 if year == 2019 & state== 26
(14,779 real changes made)

. replace state_min = 10.00 if year == 2019 & state== 27
(9,480 real changes made)

. 
. replace state_min = 9.45 if year == 2019 & state== 29 
(9,121 real changes made)

. replace state_min = 8.65 if year == 2019 & state== 30
(11,557 real changes made)

. replace state_min = 9.00 if year == 2019 & state== 31
(8,989 real changes made)

. replace state_min = 8.25 if year == 2019 & state==32
(8,689 real changes made)

. 
. replace state_min = 7.25 if year == 2019 & state== 33
(10,001 real changes made)

. replace state_min = 11.00 if year == 2019 & state== 34 
(12,921 real changes made)

. replace state_min = 9.00 if year == 2019 & state== 35 
(10,322 real changes made)

. replace state_min = 11.80 if year == 2019 & state== 36
(25,691 real changes made)

.  
. replace state_min = 7.25 if year == 2019 & state== 37 
(14,794 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 38 
(10,754 real changes made)

. replace state_min = 8.70 if year == 2019 & state== 39 
(16,058 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 40 
(9,151 real changes made)

. 
. replace state_min = 11.25 if year == 2019 & state== 41
(9,983 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 42
(17,072 real changes made)

. replace state_min = 10.50 if year == 2019 & state== 44 
(6,253 real changes made)

. replace state_min = 9.30 if year == 2019 & state== 46
(7,815 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 48 
(36,633 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 49
(11,348 real changes made)

. 
. replace state_min = 10.96 if year == 2019 & state== 50
(8,781 real changes made)

. replace state_min = 7.25 if year == 2019 & state== 51 
(12,456 real changes made)

. replace state_min = 13.50 if year == 2019 & state== 53 
(13,262 real changes made)

. replace state_min = 8.75 if year == 2019 & state== 54 
(12,257 real changes made)

. 
. replace state_min = 7.25 if year == 2019 & state== 55 
(9,339 real changes made)

. replace state_min = 5.15 if year == 2019  & state== 56 
(9,351 real changes made)

. 
. replace federal_min = 7.25 if year == 2020
(566,911 real changes made)

. 
. replace state_min = 10.19 if year == 2020 & state== 2
(7,036 real changes made)

. replace state_min = 12.00 if year == 2020 & state== 4
(9,312 real changes made)

. replace state_min = 10.00 if year == 2020 & state== 5
(8,992 real changes made)

. replace state_min = 12.00 if year == 2020 & state== 6
(48,308 real changes made)

. 
. replace state_min = 12.02 if year == 2020 & state== 8 
(7,994 real changes made)

. replace state_min = 12.00 if year == 2020 & state== 9
(6,010 real changes made)

. replace state_min = 9.25 if year == 2020 & state== 10
(5,724 real changes made)

. replace state_min = 8.56 if year == 2020 & state== 12
(23,116 real changes made)

. replace state_min = 5.15 if year == 2020 & state== 13
(12,150 real changes made)

. 
. replace state_min = 10.10 if year == 2020 & state== 15 
(7,911 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 16 
(9,975 real changes made)

. replace state_min = 10.00 if year == 2020 & state== 17 
(15,794 real changes made)

. replace state_min =  7.25 if year == 2020 & state== 18
(9,561 real changes made)

. 
. replace state_min = 7.25 if year == 2020 & state== 19 
(7,186 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 20 
(7,799 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 21
(6,188 real changes made)

. replace state_min = 12.00 if year == 2020 & state== 23
(4,582 real changes made)

. 
. replace state_min = 11.00 if year == 2020 & state== 24 
(7,419 real changes made)

. replace state_min = 12.75 if year == 2020 & state== 25 
(12,818 real changes made)

. replace state_min = 9.65 if year == 2020 & state== 26
(13,010 real changes made)

. replace state_min = 10.00 if year == 2020 & state== 27
(8,575 real changes made)

. 
. replace state_min = 9.45 if year == 2020 & state== 29 
(8,265 real changes made)

. replace state_min = 8.65 if year == 2020 & state== 30
(10,525 real changes made)

. replace state_min = 9.00 if year == 2020 & state== 31
(8,201 real changes made)

. replace state_min = 9.00 if year == 2020 & state==32
(7,520 real changes made)

. 
. replace state_min = 7.25 if year == 2020 & state== 33
(8,551 real changes made)

. replace state_min = 11.00 if year == 2020 & state== 34 
(11,187 real changes made)

. replace state_min = 9.00 if year == 2020 & state== 35 
(8,728 real changes made)

. replace state_min = 11.80 if year == 2020 & state== 36
(21,873 real changes made)

.  
. replace state_min = 7.25 if year == 2020 & state== 37 
(11,965 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 38 
(10,329 real changes made)

. replace state_min = 8.70 if year == 2020 & state== 39 
(13,818 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 40 
(8,393 real changes made)

. 
. replace state_min = 12.00 if year == 2020 & state== 41
(9,361 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 42
(14,999 real changes made)

. replace state_min = 11.50 if year == 2020 & state== 44 
(5,324 real changes made)

. replace state_min = 9.30 if year == 2020 & state== 46
(7,098 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 48 
(31,488 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 49
(10,092 real changes made)

. 
. replace state_min = 10.96 if year == 2020 & state== 50
(7,568 real changes made)

. replace state_min = 7.25 if year == 2020 & state== 51 
(10,926 real changes made)

. replace state_min = 13.50 if year == 2020  & state== 53 
(11,906 real changes made)

. replace state_min = 8.75 if year == 2020  & state== 54 
(10,004 real changes made)

. 
. replace state_min = 7.25 if year == 2019 & state== 55 
(0 real changes made)

. replace state_min = 5.15 if year == 2019  & state== 56 
(0 real changes made)

. 
. replace federal_min = 7.25 if year == 2021
(568,792 real changes made)

. 
. replace state_min = 10.34 if year == 2021 & state== 2
(6,931 real changes made)

. replace state_min = 12.15 if year == 2021  & state== 4
(9,233 real changes made)

. replace state_min = 10.00 if year == 2021  & state== 5
(9,481 real changes made)

. replace state_min = 13.00 if year == 2021 & state== 6
(49,131 real changes made)

. 
. replace state_min = 12.02 if year == 2021 & state== 8 
(8,294 real changes made)

. replace state_min = 12.00 if year == 2021 & state== 9
(5,891 real changes made)

. replace state_min = 9.25 if year == 2021 & state== 10
(6,169 real changes made)

. replace state_min = 11.00 if year == 2021 & state== 12
(25,395 real changes made)

. replace state_min = 5.15 if year == 2021 & state== 13
(12,646 real changes made)

. 
. replace state_min = 10.10 if year == 2021 & state== 15 
(7,890 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 16 
(10,298 real changes made)

. replace state_min = 10.00 if year == 2021 & state== 17 
(15,880 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 18
(9,564 real changes made)

. 
. replace state_min = 7.25 if year == 2021 & state== 19 
(6,987 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 20 
(7,620 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 21
(6,359 real changes made)

. replace state_min = 12.15 if year == 2021 & state== 23
(4,267 real changes made)

. 
. replace state_min = 11.75 if year == 2021 & state== 24 
(7,424 real changes made)

. replace state_min = 13.50 if year == 2021 & state== 25 
(12,867 real changes made)

. replace state_min = 9.65 if year == 2021 & state== 26
(12,656 real changes made)

. replace state_min = 10.08 if year == 2021 & state== 27
(7,876 real changes made)

. 
. replace state_min = 10.30 if year == 2021 & state== 29 
(8,402 real changes made)

. replace state_min = 8.75 if year == 2021 & state== 30
(10,110 real changes made)

. replace state_min = 9.00 if year == 2021 & state== 31
(8,178 real changes made)

. replace state_min = 9.75 if year == 2021 & state==32
(7,563 real changes made)

. 
. replace state_min = 7.25 if year == 2021 & state== 33
(7,480 real changes made)

. replace state_min = 12.00 if year == 2021 & state== 34 
(10,694 real changes made)

. replace state_min = 10.50 if year == 2021 & state== 35 
(8,817 real changes made)

. replace state_min = 12.50 if year == 2021 & state== 36
(19,998 real changes made)

.  
. replace state_min = 7.25 if year == 2021 & state== 37 
(13,410 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 38 
(9,963 real changes made)

. replace state_min = 8.80 if year == 2021 & state== 39 
(13,640 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 40 
(8,132 real changes made)

. 
. replace state_min = 12.75 if year == 2021 & state== 41
(9,784 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 42
(15,151 real changes made)

. replace state_min = 11.50 if year == 2021 & state== 44 
(4,987 real changes made)

. replace state_min = 9.45 if year == 2021 & state== 46
(7,039 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 48 
(33,271 real changes made)

. replace state_min = 7.25 if year == 2021 & state== 49
(10,528 real changes made)

. 
. replace state_min = 11.75 if year == 2021 & state== 50
(7,473 real changes made)

. replace state_min = 9.50 if year == 2021 & state== 51 
(10,955 real changes made)

. replace state_min = 13.69 if year == 2021 & state== 53 
(11,543 real changes made)

. replace state_min = 8.75 if year == 2021 & state== 54 
(9,559 real changes made)

. 
. replace state_min = 7.25 if year == 2021 & state== 55 
(8,434 real changes made)

. replace state_min = 5.15 if year == 2021  & state== 56 
(8,492 real changes made)

. 
. 
. 
. 
. gen min_wage = federal_min 

. replace min_wage = state_min if state_min > federal_min
(6,876,589 real changes made)

. 
. gen cpi=0  

. replace cpi=184.0 if year==2003  
(818,218 real changes made)

. replace cpi=188.9 if year==2004
(804,012 real changes made)

. replace cpi=195.3 if year==2005
(800,471 real changes made)

. 
. replace cpi=201.6 if year==2006
(795,613 real changes made)

. replace cpi=207.34 if year==2007
(785,173 real changes made)

. replace cpi=215.30 if year==2008
(782,339 real changes made)

. replace cpi=214.53 if year==2009
(785,385 real changes made)

. 
. replace cpi=218.05 if year==2010
(781,260 real changes made)

. replace cpi=224.93 if year==2011
(763,863 real changes made)

. replace cpi=229.59 if year==2012
(753,883 real changes made)

. replace cpi=232.95 if year==2013
(741,907 real changes made)

. 
. replace cpi=236.73 if year==2014
(738,066 real changes made)

. replace cpi=237.01 if year==2015
(718,949 real changes made)

. replace cpi=240.00 if year==2016
(714,471 real changes made)

. replace cpi=245.12 if year==2017
(700,029 real changes made)

. 
. replace cpi=251.10 if year==2018
(675,825 real changes made)

. replace cpi=255.65 if year==2019
(650,511 real changes made)

. replace cpi= 258.811 if year==2020
(566,911 real changes made)

. replace cpi= 270.970 if year==2021
(568,792 real changes made)

. 
. gen mwage=(min_wage)*(270.970/cpi)  

. 
. gen unemployed=(pemlr==3 | pemlr==4)

. 
. gen mwage_black=mwage*black

. gen mwage_hispanic=mwage*hispanic

. gen mwage_other=mwage*other

. 
. compress
  variable hrmonth was float now byte
  variable year was float now int
  variable state was float now byte
  variable race was float now byte
  variable sex was float now byte
  variable edu was float now byte
  variable age was float now byte
  variable marital was float now byte
  variable hisp was float now byte
  variable pemlr was float now byte
  variable female was float now byte
  variable less_hi was float now byte
  variable hi_sch was float now byte
  variable some_col was float now byte
  variable more_col was float now byte
  variable white was float now byte
  variable black was float now byte
  variable hispanic was float now byte
  variable other was float now byte
  variable agesq was float now int
  variable msa was float now byte
  variable married was float now byte
  variable unemployed was float now byte
  (934,360,426 bytes saved)

. 
. label variable mwage "Minimum wage"

. label variable mwage_black "Minimum wage for blacks"

. label variable mwage_hispanic "Minimum wage for hispanics"

. label variable mwage_other "Minimum wage for other"

. 
. 
. 
. label variable age              "Age"

. label variable agesq    "Age squared"

. label variable less_hi  "Less than high school"

. label variable hi_sch   "High school"

. label variable some_col "Some college"

. label variable more_col "College or higher"

. label variable white    "Non-Hispanic white"

. label variable black    "Non-Hispani black"

. label variable hispanic "Hispanic"

. label variable other    "Other race/ethnicity"

. label variable married  "Married"

. label variable msa              "Metropolitan Statistical Area"

. 
. su unemployed mwage white black hispanic other age married female less_hi hi_sch some_col more_col msa 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
  unemployed | 13,945,678    .0559373    .2298007          0          1
       mwage | 13,945,678    8.813291    1.290895   6.922101     14.309
       white | 13,945,678    .7086545    .4543823          0          1
       black | 13,945,678    .0919863    .2890067          0          1
    hispanic | 13,945,678    .1258548    .3316856          0          1
-------------+---------------------------------------------------------
       other | 13,945,678    .0735044    .2609626          0          1
         age | 13,945,678    40.86541    12.53704         18         64
     married | 13,945,678    .5549776    .4969683          0          1
      female | 13,945,678    .4761278    .4994298          0          1
     less_hi | 13,945,678    .0117183    .1076148          0          1
-------------+---------------------------------------------------------
      hi_sch | 13,945,678    .2864254    .4520906          0          1
    some_col | 13,945,678    .2958325    .4564161          0          1
    more_col | 13,945,678    .3365297    .4725225          0          1
         msa | 13,945,678    .7981011    .4014172          0          1

. outreg2 using table1.doc, dec(3) replace label title("Table 1 Descriptive Statistics") sum(log) eqkeep(mean sd) ///
>         keep(unemployed mwage white black hispanic other age married female less_hi hi_sch some_col more_col msa )

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hrmonth | 13,945,678    6.488694     3.45298          1         12
        year | 13,945,678    2011.504    5.375199       2003       2021
       state | 13,945,678    28.12147    15.96496          1         56
        race | 13,945,678    1.406397     1.29195          1         26
         sex | 13,945,678    1.476128    .4994298          1          2
-------------+---------------------------------------------------------
         edu | 13,945,678    40.68635    2.511305         31         46
        smsa | 13,945,678    1.210244    .4274702          1          3
         age | 13,945,678    40.86541    12.53704         18         64
     marital | 13,945,678    2.890254    2.237101          1          6
        hisp | 13,945,678    1.874145    .3316856          1          2
-------------+---------------------------------------------------------
       pemlr | 13,945,678    1.180101    .7025231         -1          4
    finalwgt | 13,945,678    2.38e+07    1.37e+07          0   3.47e+08
      female | 13,945,678    .4761278    .4994298          0          1
     less_hi | 13,945,678    .0117183    .1076148          0          1
      hi_sch | 13,945,678    .2864254    .4520906          0          1
-------------+---------------------------------------------------------
    some_col | 13,945,678    .2958325    .4564161          0          1
    more_col | 13,945,678    .3365297    .4725225          0          1
       white | 13,945,678    .7086545    .4543823          0          1
       black | 13,945,678    .0919863    .2890067          0          1
    hispanic | 13,945,678    .1258548    .3316856          0          1
-------------+---------------------------------------------------------
       other | 13,945,678    .0735044    .2609626          0          1
       agesq | 13,945,678    1827.159    1031.643        324       4096
         msa | 13,945,678    .7981011    .4014172          0          1
     married | 13,945,678    .5549776    .4969683          0          1
      weight | 13,945,678    2382.949    1374.629          0   34716.21
-------------+---------------------------------------------------------
 federal_min | 13,945,678    6.568588    .8951526       5.15       7.25
   state_min | 13,945,678    6.653401    2.676132          0      13.69
    min_wage | 13,945,678    7.349014    1.578217       5.15      13.69
         cpi | 13,945,678    224.5856    23.40385        184     270.97
       mwage | 13,945,678    8.813291    1.290895   6.922101     14.309
-------------+---------------------------------------------------------
  unemployed | 13,945,678    .0559373    .2298007          0          1
 mwage_black | 13,945,678    .7864241    2.495173          0     14.309
mwage_hisp~c | 13,945,678    1.149221    3.070855          0     14.309
 mwage_other | 13,945,678    .6806673    2.446344          0     14.309


table1.doc
dir : seeout

. 
. svy: regress unemployed mwage black hispanic other age agesq married female hi_sch some_col more_col msa i.hrmonth i.year i.state
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =         1             Number of obs     =      13,945,678
Number of PSUs     =  13945678             Population size   =  33,231,838,744
                                           Design df         =      13,945,677
                                           F(  91,13945587)  =         2586.02
                                           Prob > F          =          0.0000
                                           R-squared         =          0.0331

------------------------------------------------------------------------------
             |             Linearized
  unemployed |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       mwage |   .0005743   .0001085     5.30   0.000     .0003617    .0007869
       black |   .0443628   .0003197   138.78   0.000     .0437362    .0449893
    hispanic |   .0012184   .0002615     4.66   0.000     .0007058     .001731
       other |   .0110793   .0003039    36.46   0.000     .0104837    .0116749
         age |  -.0063703   .0000488  -130.58   0.000    -.0064659   -.0062747
       agesq |    .000066   5.64e-07   117.04   0.000     .0000649    .0000671
     married |  -.0278959   .0001618  -172.45   0.000     -.028213   -.0275789
      female |  -.0033845     .00015   -22.57   0.000    -.0036784   -.0030906
      hi_sch |  -.0371573   .0003842   -96.71   0.000    -.0379103   -.0364043
    some_col |  -.0569501    .000381  -149.47   0.000    -.0576969   -.0562033
    more_col |  -.0716635   .0003714  -192.94   0.000    -.0723915   -.0709355
         msa |  -.0030018   .0002141   -14.02   0.000    -.0034214   -.0025823
             |
     hrmonth |
          2  |  -.0012585   .0003681    -3.42   0.001      -.00198    -.000537
          3  |  -.0034104   .0003671    -9.29   0.000    -.0041299    -.002691
          4  |  -.0031742   .0003699    -8.58   0.000    -.0038992   -.0024493
          5  |  -.0038519   .0003696   -10.42   0.000    -.0045763   -.0031274
          6  |  -.0022779   .0003726    -6.11   0.000    -.0030082   -.0015475
          7  |   -.001685   .0003724    -4.52   0.000    -.0024149   -.0009552
          8  |  -.0037915   .0003686   -10.29   0.000    -.0045139   -.0030691
          9  |  -.0065607   .0003628   -18.08   0.000    -.0072718   -.0058496
         10  |  -.0080416   .0003599   -22.34   0.000     -.008747   -.0073361
         11  |  -.0085192   .0003596   -23.69   0.000     -.009224   -.0078145
         12  |  -.0075594    .000362   -20.88   0.000    -.0082689   -.0068499
             |
        year |
       2004  |   -.004773   .0004249   -11.23   0.000    -.0056058   -.0039402
       2005  |  -.0091619   .0004153   -22.06   0.000    -.0099758   -.0083481
       2006  |  -.0131505   .0004064   -32.36   0.000    -.0139469   -.0123541
       2007  |   -.013333   .0004112   -32.43   0.000    -.0141389   -.0125271
       2008  |  -.0015067   .0004317    -3.49   0.000    -.0023528   -.0006605
       2009  |   .0340461    .000494    68.93   0.000      .033078    .0350142
       2010  |   .0372593    .000506    73.63   0.000     .0362674    .0382511
       2011  |   .0308563   .0004945    62.39   0.000      .029887    .0318256
       2012  |   .0220403   .0004815    45.77   0.000     .0210966    .0229841
       2013  |    .015301   .0004709    32.50   0.000     .0143781    .0162238
       2014  |   .0035585   .0004553     7.82   0.000     .0026661    .0044509
       2015  |  -.0052029    .000446   -11.67   0.000     -.006077   -.0043288
       2016  |  -.0096888   .0004431   -21.87   0.000    -.0105573   -.0088204
       2017  |  -.0146327   .0004362   -33.55   0.000    -.0154876   -.0137777
       2018  |  -.0190217   .0004333   -43.90   0.000     -.019871   -.0181725
       2019  |  -.0213658   .0004514   -47.34   0.000    -.0222505   -.0204812
       2020  |   .0233048   .0005569    41.85   0.000     .0222133    .0243963
       2021  |  -.0029799   .0004966    -6.00   0.000    -.0039533   -.0020065
             |
       state |
          2  |   .0170296    .000899    18.94   0.000     .0152676    .0187916
          4  |   .0077643   .0008501     9.13   0.000     .0060981    .0094304
          5  |  -.0008859   .0008418    -1.05   0.293    -.0025358    .0007641
          6  |   .0171492   .0007155    23.97   0.000     .0157468    .0185516
          8  |   .0040531   .0007631     5.31   0.000     .0025574    .0055488
          9  |   .0104999   .0008438    12.44   0.000      .008846    .0121538
         10  |  -.0042605   .0008309    -5.13   0.000     -.005889    -.002632
         11  |   .0084605   .0008483     9.97   0.000     .0067979    .0101231
         12  |   .0046367   .0006888     6.73   0.000     .0032867    .0059866
         13  |   .0000355   .0007493     0.05   0.962    -.0014332    .0015042
         15  |  -.0083823   .0008306   -10.09   0.000    -.0100102   -.0067545
         16  |   .0010278   .0007951     1.29   0.196    -.0005305    .0025862
         17  |   .0135617   .0007322    18.52   0.000     .0121265    .0149969
         18  |   .0068559   .0007814     8.77   0.000     .0053245    .0083873
         19  |  -.0060744   .0007338    -8.28   0.000    -.0075125   -.0046363
         20  |  -.0008162   .0007689    -1.06   0.288    -.0023233    .0006909
         21  |   .0105921   .0008434    12.56   0.000     .0089391    .0122451
         22  |  -.0032115   .0008503    -3.78   0.000     -.004878    -.001545
         23  |   .0038121    .000812     4.69   0.000     .0022206    .0054037
         24  |  -.0070059   .0007638    -9.17   0.000    -.0085029   -.0055089
         25  |   .0085519   .0008281    10.33   0.000     .0069288    .0101751
         26  |   .0209355   .0007654    27.35   0.000     .0194354    .0224356
         27  |   .0001849   .0007326     0.25   0.801    -.0012509    .0016207
         28  |   .0036403   .0009204     3.96   0.000     .0018364    .0054442
         29  |   .0033918   .0007795     4.35   0.000      .001864    .0049197
         30  |   .0003598   .0008139     0.44   0.658    -.0012353     .001955
         31  |  -.0138834   .0007272   -19.09   0.000    -.0153088    -.012458
         32  |    .016795   .0008661    19.39   0.000     .0150975    .0184925
         33  |  -.0046602   .0007103    -6.56   0.000    -.0060524   -.0032681
         34  |   .0127313   .0007767    16.39   0.000      .011209    .0142536
         35  |    .008768   .0009034     9.71   0.000     .0069974    .0105386
         36  |   .0071865   .0007074    10.16   0.000        .0058     .008573
         37  |    .005284   .0007561     6.99   0.000      .003802    .0067659
         38  |  -.0152335   .0007164   -21.26   0.000    -.0166375   -.0138294
         39  |   .0089503   .0007272    12.31   0.000      .007525    .0103757
         40  |  -.0051225   .0008049    -6.36   0.000       -.0067    -.003545
         41  |   .0174706   .0008769    19.92   0.000     .0157519    .0191894
         42  |   .0075056   .0007082    10.60   0.000     .0061175    .0088937
         44  |   .0163982   .0008752    18.74   0.000     .0146828    .0181135
         45  |   .0054872   .0008376     6.55   0.000     .0038456    .0071288
         46  |  -.0124049   .0007518   -16.50   0.000    -.0138785   -.0109313
         47  |   .0047709   .0008089     5.90   0.000     .0031855    .0063562
         48  |  -.0013827   .0006584    -2.10   0.036    -.0026732   -.0000922
         49  |  -.0066505   .0007552    -8.81   0.000    -.0081307   -.0051703
         50  |  -.0062309   .0007959    -7.83   0.000    -.0077909    -.004671
         51  |  -.0079038   .0007203   -10.97   0.000    -.0093156    -.006492
         53  |   .0120027   .0008597    13.96   0.000     .0103178    .0136876
         54  |   .0102566   .0008501    12.07   0.000     .0085905    .0119228
         55  |   .0033257   .0007489     4.44   0.000     .0018579    .0047935
         56  |  -.0061186   .0007689    -7.96   0.000    -.0076256   -.0046116
             |
       _cons |   .2536928   .0014598   173.79   0.000     .2508316    .2565539
------------------------------------------------------------------------------

. outreg2 using table2.doc, bdec(3) replace label title("Table 2 Regression Results") ctitle("All") ///
>         keep(mwage black hispanic other age agesq married female hi_sch some_col more_col msa)
table2.doc
dir : seeout

. 
. svy: regress unemployed mwage black hispanic other age agesq married female hi_sch some_col more_col msa i.hrmonth i.year i.state if white==1
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =         1             Number of obs     =       9,882,668
Number of PSUs     = 9,882,668             Population size   =  21,568,005,269
                                           Design df         =       9,882,667
                                           F(  88,9882580)   =         1446.13
                                           Prob > F          =          0.0000
                                           R-squared         =          0.0251

------------------------------------------------------------------------------
             |             Linearized
  unemployed |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       mwage |   .0006652   .0001184     5.62   0.000     .0004332    .0008971
       black |          0  (omitted)
    hispanic |          0  (omitted)
       other |          0  (omitted)
         age |  -.0040998   .0000532   -77.01   0.000    -.0042042   -.0039955
       agesq |    .000042   6.11e-07    68.77   0.000     .0000408    .0000432
     married |  -.0288654   .0001811  -159.40   0.000    -.0292204   -.0285105
      female |  -.0044379   .0001594   -27.84   0.000    -.0047504   -.0041254
      hi_sch |   -.048465   .0005733   -84.53   0.000    -.0495886   -.0473413
    some_col |  -.0648407   .0005663  -114.50   0.000    -.0659505   -.0637308
    more_col |  -.0784195   .0005573  -140.70   0.000    -.0795119   -.0773271
         msa |  -.0014887   .0002196    -6.78   0.000    -.0019192   -.0010582
             |
     hrmonth |
          2  |  -.0005569   .0003951    -1.41   0.159    -.0013314    .0002175
          3  |  -.0026425   .0003935    -6.72   0.000    -.0034137   -.0018713
          4  |  -.0026592   .0003965    -6.71   0.000    -.0034364    -.001882
          5  |  -.0036105   .0003953    -9.13   0.000    -.0043853   -.0028356
          6  |    -.00195   .0003999    -4.88   0.000    -.0027338   -.0011662
          7  |  -.0016294   .0003996    -4.08   0.000    -.0024126   -.0008462
          8  |   -.003467   .0003952    -8.77   0.000    -.0042416   -.0026924
          9  |  -.0059984   .0003891   -15.42   0.000    -.0067611   -.0052358
         10  |  -.0076357   .0003847   -19.85   0.000    -.0083898   -.0068816
         11  |  -.0081482   .0003838   -21.23   0.000    -.0089004    -.007396
         12  |  -.0069877   .0003864   -18.08   0.000     -.007745   -.0062304
             |
        year |
       2004  |  -.0033725   .0004399    -7.67   0.000    -.0042346   -.0025104
       2005  |  -.0067085     .00043   -15.60   0.000    -.0075514   -.0058657
       2006  |  -.0090871   .0004249   -21.39   0.000    -.0099199   -.0082544
       2007  |  -.0093291   .0004309   -21.65   0.000    -.0101736   -.0084845
       2008  |  -.0000401   .0004535    -0.09   0.930    -.0009289    .0008488
       2009  |   .0309052   .0005274    58.59   0.000     .0298714     .031939
       2010  |   .0325496   .0005429    59.95   0.000     .0314855    .0336137
       2011  |   .0251244   .0005253    47.83   0.000     .0240948    .0261539
       2012  |   .0187526   .0005099    36.78   0.000     .0177532     .019752
       2013  |   .0134516   .0004989    26.96   0.000     .0124738    .0144295
       2014  |   .0029201   .0004792     6.09   0.000     .0019809    .0038593
       2015  |  -.0041303   .0004697    -8.79   0.000    -.0050508   -.0032098
       2016  |  -.0067804   .0004675   -14.50   0.000    -.0076966   -.0058641
       2017  |  -.0106104   .0004604   -23.05   0.000    -.0115127    -.009708
       2018  |  -.0136351   .0004571   -29.83   0.000    -.0145309   -.0127393
       2019  |  -.0154067   .0004759   -32.38   0.000    -.0163393    -.014474
       2020  |   .0200052   .0005893    33.95   0.000     .0188502    .0211602
       2021  |  -.0025121   .0005215    -4.82   0.000    -.0035341     -.00149
             |
       state |
          2  |   .0083977   .0009273     9.06   0.000     .0065801    .0102152
          4  |   .0059004   .0009374     6.29   0.000     .0040632    .0077375
          5  |   .0001192   .0008747     0.14   0.892    -.0015951    .0018335
          6  |   .0160573   .0007771    20.66   0.000     .0145343    .0175803
          8  |   .0032203   .0007987     4.03   0.000     .0016549    .0047857
          9  |   .0062265   .0008706     7.15   0.000     .0045202    .0079327
         10  |  -.0016134   .0008722    -1.85   0.064    -.0033228    .0000961
         11  |  -.0115846   .0008063   -14.37   0.000    -.0131649   -.0100043
         12  |   .0028238   .0007365     3.83   0.000     .0013803    .0042674
         13  |   .0013343   .0008017     1.66   0.096    -.0002371    .0029057
         15  |   .0057483   .0012386     4.64   0.000     .0033207    .0081758
         16  |   .0020642   .0008258     2.50   0.012     .0004456    .0036828
         17  |   .0107102   .0007721    13.87   0.000     .0091969    .0122235
         18  |    .006202   .0008089     7.67   0.000     .0046165    .0077874
         19  |  -.0071375   .0007505    -9.51   0.000    -.0086085   -.0056665
         20  |  -.0013376   .0007979    -1.68   0.094    -.0029015    .0002263
         21  |   .0114524   .0008693    13.17   0.000     .0097486    .0131562
         22  |  -.0040982    .000892    -4.59   0.000    -.0058465   -.0023498
         23  |   .0025266   .0008328     3.03   0.002     .0008943    .0041588
         24  |  -.0019953    .000822    -2.43   0.015    -.0036064   -.0003841
         25  |    .006265   .0008679     7.22   0.000     .0045639    .0079661
         26  |     .01773   .0007933    22.35   0.000     .0161751     .019285
         27  |  -.0017351   .0007522    -2.31   0.021    -.0032094   -.0002609
         28  |   .0007686   .0009667     0.80   0.427    -.0011262    .0026634
         29  |   .0018648   .0007994     2.33   0.020     .0002979    .0034317
         30  |   -.002229   .0008273    -2.69   0.007    -.0038505   -.0006075
         31  |  -.0150032   .0007395   -20.29   0.000    -.0164525   -.0135538
         32  |   .0155185   .0009661    16.06   0.000     .0136249    .0174121
         33  |  -.0052413   .0007331    -7.15   0.000    -.0066783   -.0038044
         34  |   .0124054   .0008318    14.91   0.000     .0107752    .0140356
         35  |   .0031889   .0010501     3.04   0.002     .0011307    .0052471
         36  |   .0052932   .0007492     7.06   0.000     .0038247    .0067617
         37  |   .0068821   .0007998     8.60   0.000     .0053145    .0084496
         38  |  -.0190171   .0007206   -26.39   0.000    -.0204295   -.0176047
         39  |   .0071433   .0007478     9.55   0.000     .0056776    .0086089
         40  |  -.0060092   .0008431    -7.13   0.000    -.0076615   -.0043568
         41  |    .018166   .0009327    19.48   0.000      .016338     .019994
         42  |   .0045059   .0007263     6.20   0.000     .0030824    .0059293
         44  |   .0114239   .0009006    12.68   0.000     .0096588    .0131891
         45  |   .0057971    .000885     6.55   0.000     .0040626    .0075316
         46  |  -.0189215   .0007357   -25.72   0.000    -.0203634   -.0174796
         47  |   .0059765   .0008352     7.16   0.000     .0043396    .0076134
         48  |   .0001231   .0007085     0.17   0.862    -.0012655    .0015117
         49  |  -.0057162   .0007881    -7.25   0.000    -.0072608   -.0041716
         50  |  -.0062866   .0008256    -7.61   0.000    -.0079048   -.0046684
         51  |  -.0050978    .000757    -6.73   0.000    -.0065815    -.003614
         53  |   .0125706   .0009194    13.67   0.000     .0107687    .0143726
         54  |   .0103766    .000876    11.85   0.000     .0086598    .0120935
         55  |  -.0001275   .0007609    -0.17   0.867    -.0016189    .0013638
         56  |  -.0067627   .0007884    -8.58   0.000    -.0083079   -.0052175
             |
       _cons |    .211737   .0016181   130.86   0.000     .2085656    .2149084
------------------------------------------------------------------------------

. outreg2 using table2.doc, bdec(3) append label title("Table 2 Regression Results") ctitle("White") ///
>         keep(mwage black hispanic other age agesq married female hi_sch some_col more_col msa)
table2.doc
dir : seeout

. 
. svy: regress unemployed mwage black hispanic other age agesq married female hi_sch some_col more_col msa i.hrmonth i.year i.state if black==1
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =         1              Number of obs     =      1,282,812
Number of PSUs     = 1,282,812              Population size   =  3,842,125,052
                                            Design df         =      1,282,811
                                            F(  88,1282724)   =         545.21
                                            Prob > F          =         0.0000
                                            R-squared         =         0.0563

------------------------------------------------------------------------------
             |             Linearized
  unemployed |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       mwage |   .0005584    .000444     1.26   0.208    -.0003117    .0014286
       black |          0  (omitted)
    hispanic |          0  (omitted)
       other |          0  (omitted)
         age |  -.0115378    .000187   -61.69   0.000    -.0119043   -.0111712
       agesq |   .0001111   2.19e-06    50.63   0.000     .0001068    .0001154
     married |  -.0382132    .000594   -64.33   0.000    -.0393774    -.037049
      female |  -.0169739   .0006161   -27.55   0.000    -.0181814   -.0157664
      hi_sch |  -.0849093   .0014849   -57.18   0.000    -.0878197   -.0819989
    some_col |  -.1202588   .0014695   -81.84   0.000     -.123139   -.1173786
    more_col |  -.1454387   .0014577   -99.77   0.000    -.1482958   -.1425816
         msa |   -.012149     .00113   -10.75   0.000    -.0143637   -.0099342
             |
     hrmonth |
          2  |  -.0019029   .0014777    -1.29   0.198    -.0047991    .0009933
          3  |  -.0048707   .0014728    -3.31   0.001    -.0077574   -.0019841
          4  |  -.0045848   .0014759    -3.11   0.002    -.0074775   -.0016921
          5  |  -.0035437   .0014817    -2.39   0.017    -.0064478   -.0006396
          6  |  -.0021145   .0014824    -1.43   0.154      -.00502    .0007909
          7  |   .0028646   .0014928     1.92   0.055    -.0000612    .0057904
          8  |  -.0004138   .0014806    -0.28   0.780    -.0033157     .002488
          9  |  -.0056147   .0014582    -3.85   0.000    -.0084727   -.0027568
         10  |  -.0057355   .0014548    -3.94   0.000    -.0085869   -.0028841
         11  |   -.008644   .0014493    -5.96   0.000    -.0114846   -.0058034
         12  |  -.0092478   .0014583    -6.34   0.000    -.0121061   -.0063895
             |
        year |
       2004  |  -.0039531   .0017876    -2.21   0.027    -.0074567   -.0004495
       2005  |  -.0103294   .0017664    -5.85   0.000    -.0137915   -.0068674
       2006  |  -.0175921   .0017264   -10.19   0.000    -.0209758   -.0142083
       2007  |  -.0226518   .0017106   -13.24   0.000    -.0260044   -.0192992
       2008  |   -.004392   .0017799    -2.47   0.014    -.0078806   -.0009035
       2009  |   .0439411    .001975    22.25   0.000     .0400702     .047812
       2010  |   .0560465   .0020332    27.57   0.000     .0520615    .0600316
       2011  |   .0568532   .0020241    28.09   0.000     .0528861    .0608203
       2012  |   .0389479   .0019631    19.84   0.000     .0351003    .0427956
       2013  |    .028995   .0019247    15.07   0.000     .0252228    .0327673
       2014  |   .0132748   .0018777     7.07   0.000     .0095946    .0169549
       2015  |  -.0044703   .0018244    -2.45   0.014     -.008046   -.0008946
       2016  |  -.0145675   .0018098    -8.05   0.000    -.0181146   -.0110203
       2017  |  -.0219978   .0017722   -12.41   0.000    -.0254711   -.0185244
       2018  |  -.0325546   .0017441   -18.67   0.000     -.035973   -.0291362
       2019  |  -.0353074   .0017964   -19.65   0.000    -.0388284   -.0317865
       2020  |   .0188236    .002149     8.76   0.000     .0146116    .0230356
       2021  |  -.0070578    .001979    -3.57   0.000    -.0109366   -.0031789
             |
       state |
          2  |  -.0097483   .0045687    -2.13   0.033    -.0187028   -.0007938
          4  |  -.0021948   .0038189    -0.57   0.565    -.0096798    .0052901
          5  |   .0003868    .002679     0.14   0.885     -.004864    .0056375
          6  |    .032409   .0024191    13.40   0.000     .0276676    .0371504
          8  |   .0034007   .0037935     0.90   0.370    -.0040343    .0108358
          9  |   .0108827   .0030966     3.51   0.000     .0048136    .0169519
         10  |  -.0094956   .0023084    -4.11   0.000      -.01402   -.0049712
         11  |   .0417058   .0020164    20.68   0.000     .0377537    .0456578
         12  |  -.0022822   .0019492    -1.17   0.242    -.0061026    .0015382
         13  |     .00254   .0018521     1.37   0.170    -.0010901    .0061701
         15  |   .0102952   .0085045     1.21   0.226    -.0063733    .0269638
         16  |  -.0229839   .0123899    -1.86   0.064    -.0472676    .0012999
         17  |   .0362956   .0023114    15.70   0.000     .0317654    .0408259
         18  |   .0170569   .0029454     5.79   0.000     .0112839    .0228298
         19  |   .0176669   .0050774     3.48   0.001     .0077154    .0276184
         20  |   .0059791    .003526     1.70   0.090    -.0009318    .0128899
         21  |   .0090852   .0033574     2.71   0.007     .0025049    .0156656
         22  |  -.0072746    .002093    -3.48   0.001    -.0113767   -.0031725
         23  |  -.0045369   .0084404    -0.54   0.591    -.0210797     .012006
         24  |  -.0082451   .0019419    -4.25   0.000    -.0120512    -.004439
         25  |  -.0023654    .003242    -0.73   0.466    -.0087197    .0039889
         26  |     .04037   .0024964    16.17   0.000     .0354772    .0452628
         27  |   .0127947   .0034788     3.68   0.000     .0059763     .019613
         28  |   .0035557   .0021247     1.67   0.094    -.0006087      .00772
         29  |   .0114325   .0027131     4.21   0.000      .006115      .01675
         30  |  -.0169837   .0127221    -1.33   0.182    -.0419186    .0079513
         31  |  -.0153767   .0038638    -3.98   0.000    -.0229497   -.0078037
         32  |   .0263156   .0033687     7.81   0.000     .0197131    .0329182
         33  |  -.0269934   .0057502    -4.69   0.000    -.0382635   -.0157232
         34  |   .0171688   .0025361     6.77   0.000     .0121982    .0221394
         35  |   .0055839    .006637     0.84   0.400    -.0074244    .0185921
         36  |   .0074164   .0020827     3.56   0.000     .0033344    .0114984
         37  |   .0071851   .0020306     3.54   0.000     .0032051    .0111651
         38  |  -.0235257   .0051637    -4.56   0.000    -.0336463    -.013405
         39  |   .0185362   .0024136     7.68   0.000     .0138055    .0232668
         40  |   -.010078   .0031487    -3.20   0.001    -.0162493   -.0039067
         41  |    .020161   .0062488     3.23   0.001     .0079136    .0324085
         42  |   .0120411    .002433     4.95   0.000     .0072726    .0168097
         44  |  -.0063243   .0037574    -1.68   0.092    -.0136886      .00104
         45  |   .0037262   .0020995     1.77   0.076    -.0003887     .007841
         46  |  -.0472805    .006933    -6.82   0.000     -.060869   -.0336919
         47  |   .0038064   .0024449     1.56   0.119    -.0009854    .0085983
         48  |    .003203   .0018874     1.70   0.090    -.0004962    .0069022
         49  |  -.0421252   .0065812    -6.40   0.000    -.0550242   -.0292262
         50  |  -.0296805   .0075879    -3.91   0.000    -.0445525   -.0148085
         51  |  -.0171827   .0019849    -8.66   0.000    -.0210729   -.0132924
         53  |   .0091478   .0043171     2.12   0.034     .0006863    .0176092
         54  |  -.0015035   .0046094    -0.33   0.744    -.0105378    .0075309
         55  |   .0386659   .0039303     9.84   0.000     .0309626    .0463692
         56  |  -.0020571   .0101717    -0.20   0.840    -.0219932     .017879
             |
       _cons |   .4936941   .0054872    89.97   0.000     .4829393    .5044489
------------------------------------------------------------------------------

. outreg2 using table2.doc, bdec(3) append label title("Table 2 Regression Results") ctitle("Black") ///
>         keep(mwage black hispanic other age agesq married female hi_sch some_col more_col msa)
table2.doc
dir : seeout

. 
. svy: regress unemployed mwage black hispanic other age agesq married female hi_sch some_col more_col msa i.hrmonth i.year i.state if hispanic==1
(running regress on estimation sample)

Survey: Linear regression

Number of strata   =         1              Number of obs     =      1,755,130
Number of PSUs     = 1,755,130              Population size   =  5,336,446,042
                                            Design df         =      1,755,129
                                            F(  88,1755042)   =         366.71
                                            Prob > F          =         0.0000
                                            R-squared         =         0.0255

------------------------------------------------------------------------------
             |             Linearized
  unemployed |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       mwage |  -.0023948   .0002997    -7.99   0.000    -.0029821   -.0018074
       black |          0  (omitted)
    hispanic |          0  (omitted)
       other |          0  (omitted)
         age |  -.0089759   .0001378   -65.14   0.000     -.009246   -.0087058
       agesq |   .0000985   1.67e-06    58.99   0.000     .0000952    .0001018
     married |  -.0200432    .000455   -44.05   0.000     -.020935   -.0191514
      female |   .0101182   .0004488    22.54   0.000     .0092385    .0109979
      hi_sch |  -.0183358   .0006026   -30.43   0.000    -.0195169   -.0171546
    some_col |  -.0361786   .0006331   -57.14   0.000    -.0374195   -.0349377
    more_col |  -.0482929   .0006401   -75.45   0.000    -.0495475   -.0470384
         msa |   -.001524   .0008637    -1.76   0.078    -.0032168    .0001688
             |
     hrmonth |
          2  |  -.0036609   .0010827    -3.38   0.001    -.0057829   -.0015389
          3  |  -.0062719   .0010808    -5.80   0.000    -.0083902   -.0041536
          4  |  -.0063758   .0010882    -5.86   0.000    -.0085086    -.004243
          5  |  -.0075776   .0010869    -6.97   0.000    -.0097079   -.0054472
          6  |  -.0061575   .0010929    -5.63   0.000    -.0082997   -.0040154
          7  |  -.0068445   .0010839    -6.31   0.000    -.0089688   -.0047201
          8  |   -.008503    .001076    -7.90   0.000    -.0106119   -.0063942
          9  |  -.0112996   .0010592   -10.67   0.000    -.0133756   -.0092237
         10  |  -.0129357   .0010503   -12.32   0.000    -.0149943   -.0108771
         11  |  -.0117976    .001054   -11.19   0.000    -.0138635   -.0097318
         12  |  -.0096341   .0010661    -9.04   0.000    -.0117237   -.0075445
             |
        year |
       2004  |  -.0085553   .0013821    -6.19   0.000    -.0112642   -.0058463
       2005  |  -.0168071    .001325   -12.68   0.000    -.0194041   -.0142101
       2006  |  -.0234429   .0012713   -18.44   0.000    -.0259347   -.0209512
       2007  |  -.0172501   .0012975   -13.30   0.000     -.019793   -.0147071
       2008  |   .0021271   .0013682     1.55   0.120    -.0005546    .0048088
       2009  |   .0499703   .0015415    32.42   0.000     .0469491    .0529915
       2010  |   .0539954   .0015543    34.74   0.000      .050949    .0570418
       2011  |   .0437162   .0015257    28.65   0.000     .0407258    .0467066
       2012  |   .0310041   .0014808    20.94   0.000     .0281018    .0339064
       2013  |   .0194913   .0014332    13.60   0.000     .0166822    .0223003
       2014  |   .0042992   .0013759     3.12   0.002     .0016024    .0069959
       2015  |  -.0027483   .0013576    -2.02   0.043    -.0054092   -.0000874
       2016  |  -.0100494   .0013396    -7.50   0.000    -.0126751   -.0074238
       2017  |  -.0165256   .0013161   -12.56   0.000    -.0191052   -.0139461
       2018  |   -.020176   .0013117   -15.38   0.000    -.0227469   -.0176051
       2019  |  -.0220208    .001364   -16.14   0.000    -.0246942   -.0193474
       2020  |   .0405032   .0016705    24.25   0.000     .0372291    .0437773
       2021  |   .0054416   .0015089     3.61   0.000     .0024843     .008399
             |
       state |
          2  |   .0218936   .0043343     5.05   0.000     .0133987    .0303886
          4  |   .0276085   .0034592     7.98   0.000     .0208286    .0343884
          5  |  -.0057204   .0039108    -1.46   0.144    -.0133854    .0019446
          6  |   .0401332   .0033673    11.92   0.000     .0335334     .046733
          8  |   .0222589   .0034837     6.39   0.000      .015431    .0290868
          9  |   .0567859   .0039141    14.51   0.000     .0491144    .0644574
         10  |    .008443   .0038982     2.17   0.030     .0008028    .0160833
         11  |   .0077002   .0036385     2.12   0.034     .0005689    .0148315
         12  |    .026799   .0033132     8.09   0.000     .0203051    .0332928
         13  |   .0036448   .0035633     1.02   0.306    -.0033391    .0106287
         15  |   .0296294   .0040514     7.31   0.000     .0216887      .03757
         16  |   .0099896   .0037015     2.70   0.007     .0027347    .0172445
         17  |   .0299633   .0034436     8.70   0.000     .0232139    .0367128
         18  |   .0171789   .0040176     4.28   0.000     .0093045    .0250534
         19  |   .0125066   .0040642     3.08   0.002     .0045409    .0204722
         20  |   .0098744   .0037453     2.64   0.008     .0025338    .0172151
         21  |   .0126782    .005119     2.48   0.013     .0026451    .0227112
         22  |   .0201288   .0044369     4.54   0.000     .0114327    .0288249
         23  |   .0613082   .0082429     7.44   0.000     .0451524    .0774641
         24  |   .0046081   .0036235     1.27   0.203    -.0024938    .0117101
         25  |   .0525942   .0040252    13.07   0.000      .044705    .0604835
         26  |   .0409866   .0041746     9.82   0.000     .0328045    .0491687
         27  |   .0147338   .0040849     3.61   0.000     .0067274    .0227401
         28  |   .0073077   .0053427     1.37   0.171    -.0031639    .0177793
         29  |   .0156142   .0044716     3.49   0.000       .00685    .0243783
         30  |    .023131   .0052632     4.39   0.000     .0128153    .0334467
         31  |    .003037   .0036965     0.82   0.411     -.004208    .0102821
         32  |   .0340168   .0034965     9.73   0.000     .0271639    .0408697
         33  |   .0202936   .0047521     4.27   0.000     .0109797    .0296075
         34  |   .0283107   .0034707     8.16   0.000     .0215082    .0351132
         35  |   .0236678   .0034013     6.96   0.000     .0170014    .0303342
         36  |   .0377213   .0034196    11.03   0.000      .031019    .0444237
         37  |    .010933   .0036105     3.03   0.002     .0038566    .0180094
         38  |   .0079212   .0050142     1.58   0.114    -.0019065    .0177489
         39  |   .0278237   .0042766     6.51   0.000     .0194417    .0362057
         40  |   .0053272   .0038549     1.38   0.167    -.0022283    .0128827
         41  |   .0312874   .0038574     8.11   0.000     .0237271    .0388477
         42  |   .0499393   .0039633    12.60   0.000     .0421714    .0577072
         44  |   .0713078    .004104    17.38   0.000     .0632641    .0793514
         45  |   .0074719   .0042836     1.74   0.081    -.0009238    .0158677
         46  |   .0089239   .0049813     1.79   0.073    -.0008394    .0186871
         47  |   .0046068     .00406     1.13   0.257    -.0033507    .0125642
         48  |   .0107037   .0032469     3.30   0.001     .0043399    .0170675
         49  |   .0039714    .003556     1.12   0.264    -.0029981     .010941
         50  |   .0173159   .0060683     2.85   0.004     .0054222    .0292096
         51  |   .0004505   .0035682     0.13   0.900    -.0065431    .0074442
         53  |   .0353832   .0038413     9.21   0.000     .0278544    .0429121
         54  |   .0169982   .0063969     2.66   0.008     .0044605    .0295359
         55  |   .0257065   .0040689     6.32   0.000     .0177317    .0336814
         56  |   .0092223   .0038602     2.39   0.017     .0016565     .016788
             |
       _cons |   .2850162   .0048072    59.29   0.000     .2755942    .2944382
------------------------------------------------------------------------------

. outreg2 using table2.doc, bdec(3) append label title("Table 2 Regression Results") ctitle("Hispanic") ///
>         keep(mwage black hispanic other age agesq married female hi_sch some_col more_col msa)
table2.doc
dir : seeout

. 
. log close
      name:  <unnamed>
       log:  c:\Eco387\luis84.log
  log type:  text
 closed on:   8 Nov 2022, 12:49:42
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
